cmsis-svd/cmsis-svd/data/Maxim/max32650.svd
<?xml version="1.0" encoding="utf-8"?>
<device schemaVersion="1.1" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:noNamespaceSchemaLocation="CMSIS-SVD.xsd">
  <vendor>Maxim Integrated</vendor>
  <vendorID>Maxim</vendorID>
  <name>max32650</name>
  <series>ARMCM4</series>
  <version>1.0</version>
  <description>MAX32650 32-bit ARM Cortex-M4 microcontroller with 1MB of system RAM and 3MB of flash memory.</description>
  <cpu>
    <name>CM4</name>
    <revision>r2p1</revision>
    <endian>little</endian>
    <mpuPresent>true</mpuPresent>
    <fpuPresent>true</fpuPresent>
    <nvicPrioBits>3</nvicPrioBits>
    <vendorSystickConfig>false</vendorSystickConfig>
  </cpu>
  <addressUnitBits>8</addressUnitBits>
  <width>32</width>
  <size>32</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xFFFFFFFF</resetMask>
  <peripherals>
    <peripheral>
      <name>ADC</name>
      <description>10-bit Analog to Digital Converter</description>
      <baseAddress>0x40034000</baseAddress>
      <size>32</size>
      <access>read-write</access>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>ADC</name>
        <description>ADC IRQ</description>
        <value>20</value>
      </interrupt>
      <registers>
        <register>
          <name>CTRL</name>
          <description>ADC Control</description>
          <addressOffset>0x0000</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>start</name>
              <description>Start ADC Conversion</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pwr</name>
              <description>ADC Power Up</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>refbuf_pwr</name>
              <description>ADC Reference Buffer Power Up</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>chgpump_pwr</name>
              <description>ADC Charge Pump Power Up</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ref_scale</name>
              <description>ADC Reference Scale</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>scale</name>
              <description>ADC Scale</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ref_sel</name>
              <description>ADC Reference (VRef) Select (INTERNAL ONLY)</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>clk_en</name>
              <description>ADC Clock Enable</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ch_sel</name>
              <description>ADC Channel Select</description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>adc_xref</name>
              <description>Enable Use of ADC External Reference</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>data_align</name>
              <description>ADC Data Alignment Select</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS</name>
          <description>ADC Status</description>
          <addressOffset>0x0004</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>active</name>
              <description>ADC Conversion In Progress</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>afe_pwr_up_active</name>
              <description>AFE Power Up Delay Active</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>overflow</name>
              <description>ADC Overflow</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATA</name>
          <description>ADC Output Data</description>
          <addressOffset>0x0008</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>adc_data</name>
              <description>ADC Converted Sample Data Output</description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTR</name>
          <description>ADC Interrupt Control Register</description>
          <addressOffset>0x000C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>done_ie</name>
              <description>ADC Done Interrupt Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ref_ready_ie</name>
              <description>ADC Reference Ready Interrupt Enable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>hi_limit_ie</name>
              <description>ADC Hi Limit Monitor Interrupt Enable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>lo_limit_ie</name>
              <description>ADC Lo Limit Monitor Interrupt Enable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>overflow_ie</name>
              <description>ADC Overflow Interrupt Enable</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>done_if</name>
              <description>ADC Done Interrupt Flag</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>ref_ready_if</name>
              <description>ADC Reference Ready Interrupt Flag</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>hi_limit_if</name>
              <description>ADC Hi Limit Monitor Interrupt Flag</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>lo_limit_if</name>
              <description>ADC Lo Limit Monitor Interrupt Flag</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>overflow_if</name>
              <description>ADC Overflow Interrupt Flag</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>pending</name>
              <description>ADC Interrupt Pending Status</description>
              <bitRange>[22:22]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>4</dimIncrement>
          <name>LIMIT[%s]</name>
          <description>ADC Limit</description>
          <addressOffset>0x0010</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>ch_lo_limit</name>
              <description>Low Limit Threshold</description>
              <bitRange>[9:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ch_hi_limit</name>
              <description>High Limit Threshold</description>
              <bitRange>[21:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ch_sel</name>
              <description>ADC Channel Select</description>
              <bitRange>[27:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ch_lo_limit_en</name>
              <description>Low Limit Monitoring Enable</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ch_hi_limit_en</name>
              <description>High Limit Monitoring Enable</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
