cmsis-svd/cmsis-svd/data/Maxim/max32650.svd
      </registers>
    </peripheral>
    <!--ADC 10-bit Analog to Digital Converter-->
    <peripheral>
      <name>BBFC</name>
      <description>Battery-Backed Function Control.</description>
      <baseAddress>0x40005800</baseAddress>
      <addressBlock>
        <offset>0x00</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>BBFCR0</name>
          <description>Function Control Register 0.</description>
          <addressOffset>0x00</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CKPDRV</name>
              <description>Hyperbus CK Pad Driver Control.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>CKNPDRV</name>
              <description>Hyperbus CKN Pad Driver Control.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>RDSDLLEN</name>
              <description>Hyperbus RDS DLL Power Up Control.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dis</name>
                  <description>Disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>en</name>
                  <description>Enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <!--BBFC Battery-Backed Function Control.-->
    <peripheral>
      <name>BBSIR</name>
      <description>Battery-Backed Registers.</description>
      <baseAddress>0x40005400</baseAddress>
      <addressBlock>
        <offset>0x00</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>BB_SIR2</name>
          <description>System Init. Configuration Register 2.</description>
          <addressOffset>0x08</addressOffset>
          <access>read-only</access>
        </register>
        <register>
          <name>BB_SIR3</name>
          <description>System Init. Configuration Register 3.</description>
          <addressOffset>0x0C</addressOffset>
          <access>read-only</access>
        </register>
      </registers>
    </peripheral>
    <!--BBSIR Battery-Backed Registers.-->
    <peripheral>
      <name>CRYPTO</name>
      <description>The Cryptographic Accelerator used to assist the computationally intensive operations of several common algorithms.</description>
      <baseAddress>0x40001000</baseAddress>
      <addressBlock>
        <offset>0x00</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>Crypto_Engine</name>
        <description>Crypto Engine interrupt.</description>
        <value>27</value>
      </interrupt>
      <registers>
        <register>
          <name>CTRL</name>
          <description>Crypto Control Register.</description>
          <addressOffset>0x00</addressOffset>
          <resetValue>0xC0000000</resetValue>
          <fields>
            <field>
              <name>RST</name>
              <description>Reset. This bit is used to reset the crypto accelerator. All crypto internal states and related registers are reset to their default reset values. Control register such as CRYPTO_CTRL, CIPHER_CTRL, HASH_CTRL, CRC_CTRL, MAA_CTRL (with the exception of the STC bit), HASH_MSG_SZ_[3:0] and MAA_MAWS will retain their values. This bit will automatically clear itself after one cycle.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>reset_write</name>
                <usage>write</usage>
                <enumeratedValue>
                  <name>reset</name>
                  <description>Starts reset operation.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <name>reset_read</name>
                <usage>read</usage>
                <enumeratedValue>
                  <name>reset_done</name>
                  <description>Reset complete.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>busy</name>
                  <description>Reset in progress.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INTR</name>
              <description>Interrupt Enable. Generates an interrupt when done or error set.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dis</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>en</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRC</name>
              <description>Source Select. This bit selects the hash function and CRC generator input source.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>inputFIFO</name>
                  <description>Input FIFO</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>outputFIFO</name>
                  <description>Output FIFO</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field derivedFrom="INTR">
              <name>BSO</name>
              <description>Byte Swap Output. Note. No byte swap will occur if there is not a full word.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="INTR">
              <name>BSI</name>
              <description>Byte Swap Input. Note. No byte swap will occur if there is not a full word.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="INTR">
              <name>WAIT_EN</name>
              <description>Wait Pin Enable. This can be used to hold off the crypto DMA until an external memory is ready. This is useful for transferring pages from NAND flash which may take several microseconds to become ready.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WAIT_POL</name>
              <description>Wait Pin Polarity. When the wait pin is enabled, this bit selects its active state.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>activeLo</name>
                  <description>Active Low.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>activeHi</name>
                  <description>Active High.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WRSRC</name>
              <description>Write FIFO Source Select. This field determines where data written to the write FIFO comes from. When data is written to the write FIFO, it is always written out the DMA. To decrypt or encrypt data, the write FIFO source should be set to the cipher output. To implement memcpy() or memset() functions, or to fill memory with random data, the write FIFO source should be set to the read FIFO. When calculating a HASH or CMAC, the write FIFO should be disabled.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>none</name>
                  <description>None.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>cipherOutput</name>
                  <description>Cipher Output.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>readFIFO</name>
                  <description>Read FIFO.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RFU</name>
                  <description>Reserved. Do not use.</description>
                  <isDefault>true</isDefault>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RDSRC</name>
              <description>Read FIFO Source Select. This field selects the source of the read FIFO. Typically, it is set to use the DMA. To implement a memset() function, the read FIFO DMA should be disabled. To fill memory with random data or to hash random numbers, the read FIFO source should be set to the random number generator.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dmaDisabled</name>
                  <description>DMA Disable.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dmaOrApb</name>
                  <description>DMA Or APB.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>rng</name>
                  <description>RNG.</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLAG_MODE</name>
              <description>Done Flag Mode. This bit configures the access behavior of the individual CRYPTO_CTRL Done flags (CRYPTO_CTRL[27:24]). This bit is cleared only on reset to limit upkeep, i.e. once set, it will remain set until a reset occurs.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>unres_wr</name>
                  <description>Unrestricted write (0 or 1) of CRYPTO_CTRL[27:24] flags.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>res_wr</name>
                  <description>Access to CRYPTO_CTRL[27:24] are write 1 to clear/write 0 no effect.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMADNEMSK</name>
              <description>DMA Done Flag Mask. This bit masks the DMA_DONE flag from being used to generate the CRYPTO_CTRL.DONE flag, and this disables a DMA_DONE condition from generating and interrupt. The DMA_DONE flag itself is unaffected and still may be monitored. This allows more optimal interrupt-driven crypto operations using DMA.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>not_used</name>
                  <description>DMA_DONE not used in setting CRYPTO_CTRL.DONE bit.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>used</name>
                  <description>DMA_DONE used in setting CRYPTO_CTRL.DONE bit.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMA_DONE</name>
              <description>DMA Done. DMA write/read operation is complete. This bit must be cleared before starting a DMA operation.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>notDone</name>
                  <description>Not Done.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>done</name>
                  <description>Done.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field derivedFrom="DMA_DONE">
              <name>GLS_DONE</name>
              <description>Galois Done. FIFO is full and CRC or Hamming Code Generator is enabled. This bit must be cleared before starting a CRC operation Note that DMA_DONE must be polled instead of this bit to determine the end of DMA operation during the utilization of Hamming Code Generator.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="DMA_DONE">
              <name>HSH_DONE</name>
              <description>Hash Done. SHA operation is complete. This bit must be cleared before starting a HASH operation.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="DMA_DONE">
              <name>CPH_DONE</name>
              <description>Cipher Done. Either AES or DES encryption/decryption operation is complete. This bit must be cleared before starting a cipher operation.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="DMA_DONE">
              <name>MAA_DONE</name>
              <description>MAA Done. MAA operation is complete. This bit must be cleared before starting a new MAA operation. This bit is read only while the MAA is in progress. This bit is negate of MAA_CTRL.STC.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ERR</name>
              <description>AHB Bus Error. This bit is set when the DMA encounters a bus error during a read or write operation. Once this bit is set, the DMA will stop. This bit can only be cleared by resetting the crypto block.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>noError</name>
                  <description>No Error.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>error</name>
                  <description>Error.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RDY</name>
              <description>Ready. Crypto block ready for more data.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>busy</name>
                  <description>Busy.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ready</name>
                  <description>Ready.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field derivedFrom="DMA_DONE">
              <name>DONE</name>
              <description>Done. One or more cryptographic calculations complete (logical OR of done flags).</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CIPHER_CTRL</name>
          <description>Cipher Control Register.</description>
          <addressOffset>0x04</addressOffset>
          <fields>
            <field>
              <name>ENC</name>
              <description>Encrypt. Select encryption or decryption of input data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>encrypt</name>
                  <description>Encrypt.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>decrypt</name>
                  <description>Decrypt.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>KEY</name>
              <description>Load Key from crypto DMA. This bit is automatically cleared by hardware after the DMA has completed loading the key. When the DMA operation is done, it sets the appropriate crypto DMA Done flag.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>complete</name>
                  <description>No operation/complete.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>start</name>
                  <description>Start operation.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRC</name>
              <description>Source of Random key.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>cipherKey</name>
                  <description>User cipher key (0x4000_1060).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>regFile</name>
                  <description>Key from battery-backed register file (0x4000_5000 to 0x4000_501F).</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>qspiKey_regFile</name>
                  <description>Key from battery-backed register file (0x4000_5020 to 0x4000_502F).</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CIPHER</name>
              <description>Cipher Operation Select. Symmetric Block Cipher algorithm selection or memory operation.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dis</name>
                  <description>Disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>aes128</name>
                  <description>AES 128.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>aes192</name>
                  <description>AES 192.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>aes256</name>
                  <description>AES 256.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>des</name>
                  <description>DES.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>tdes</name>
                  <description>Triple DES.</description>
                  <value>5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MODE</name>
              <description>Mode Select. Mode of operation for block cipher or memory operation. DES/TDES cannot be used in CFB, OFB or CTR modes.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ECB</name>
                  <description>ECB Mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBC</name>
                  <description>CBC Mode.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CFB</name>
                  <description>CFB (AES only).</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFB</name>
                  <description>OFB (AES only).</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CTR</name>
                  <description>CTR (AES only).</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
