cmsis-svd/cmsis-svd/data/Maxim/max32650.svd
        <register>
          <name>HASH_CTRL</name>
          <description>HASH Control Register.</description>
          <addressOffset>0x08</addressOffset>
          <fields>
            <field>
              <name>INIT</name>
              <description>Initialize. Initializes hash registers with standard constants.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nop</name>
                  <description>No operation/complete.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>start</name>
                  <description>Start operation.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>XOR</name>
              <description>XOR data with IV from cipher block. Useful when calculating HMAC to XOR the input pad and output pad.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dis</name>
                  <description>Disable.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>en</name>
                  <description>Enable.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HASH</name>
              <description>Hash function selection.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dis</name>
                  <description>Disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sha1</name>
                  <description>SHA-1.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sha224</name>
                  <description>SHA 224.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sha256</name>
                  <description>SHA 256.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sha384</name>
                  <description>SHA 384.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sha512</name>
                  <description>SHA 512.</description>
                  <value>5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LAST</name>
              <description>Last Message Bit. This bit shall be set along with the HASH_MSG_SZ register prior to hashing the last 512 or 1024-bit block of the message data. It will allow automatic preprocessing of the last message padding, which includes the trailing bit 1, followed by the respective number of zero bits for the last block size and finally the message length represented in bytes. The bit will be automatically cleared at the same time the HASH DONE is set, designating the completion of the last message hash.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>noEffect</name>
                  <description>No Effect.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>lastMsgData</name>
                  <description>Last Message Data.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CRC_CTRL</name>
          <description>CRC Control Register.</description>
          <addressOffset>0x0C</addressOffset>
          <fields>
            <field>
              <name>CRC</name>
              <description>Cyclic Redundancy Check Enable. The CRC cannot be enabled if the PRNG is enabled.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dis</name>
                  <description>Disable.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>en</name>
                  <description>Enable.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MSB</name>
              <description>MSB select. This bit selects the order of calculating CRC on data.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>lsbFirst</name>
                  <description>LSB First.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>msbFirst</name>
                  <description>MSB First.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field derivedFrom="CRC">
              <name>PRNG</name>
              <description>Pseudo Random Number Generator Enable. If entropy is disabled, this outputs one byte of pseudo random data per clock cycle. If entropy is enabled, data is output at a rate of one bit per clock cycle.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="CRC">
              <name>ENT</name>
              <description>Entropy Enable. If the PRNG is enabled, this mixes the high frequency ring oscillator with the LFSR. If the PRNG is disabled, the raw entropy data is output at a rate of 1 bit per clock. This makes it possible to characterize the quality of the entropy source.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="CRC">
              <name>HAM</name>
              <description>Hamming Code Enable. Enable hamming code calculation.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HRST</name>
              <description>Hamming Reset. Reset Hamming code ECC generator for next block.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>RFU</name>
                  <description>Reserved. Do not use.</description>
                  <isDefault>true</isDefault>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>reset</name>
                  <description>Starts reset operation.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_SRC</name>
          <description>Crypto DMA Source Address.</description>
          <addressOffset>0x10</addressOffset>
          <fields>
            <field>
              <name>ADDR</name>
              <description>DMA Source Address.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_DEST</name>
          <description>Crypto DMA Destination Address.</description>
          <addressOffset>0x14</addressOffset>
          <fields>
            <field>
              <name>ADDR</name>
              <description>DMA Destination Address.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_CNT</name>
          <description>Crypto DMA Byte Count.</description>
          <addressOffset>0x18</addressOffset>
          <fields>
            <field>
              <name>ADDR</name>
              <description>DMA Byte Address.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MAA_CTRL</name>
          <description>MAA Control Register.</description>
          <addressOffset>0x1C</addressOffset>
          <fields>
            <field>
              <name>STC</name>
              <description>Start Calculation. This bit functions as both the control and the status of the MAA. If the size value in the MAWS register is invalid, the STC bit will be cleared by hardware immediately. Otherwise, the STC bit is automatically cleared following the completion of each calculation or detecting an error. Clearing the STC bit resets the controller to its default state.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nop</name>
                  <description>No operation/complete.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>start</name>
                  <description>Start operation.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLC</name>
              <description>Calculation Configuration. These bits select desired calculation.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>exp</name>
                  <description>Exponentiation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sq</name>
                  <description>Square operation.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>mul</name>
                  <description>Multiplication.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sqMul</name>
                  <description>Square followed by a multiplication.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>add</name>
                  <description>Addition.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sub</name>
                  <description>Subtraction.</description>
                  <value>5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OCALC</name>
              <description>Optimized Calculation Control. For optimized calculation, unnecessary multiply operations after normalizing the exponent are skipped.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dis</name>
                  <description>Disable.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>en</name>
                  <description>Enable.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MAAER</name>
              <description>MAA Error. The MAAER bit defaults to 0 and can only be set by hardware. Once set, it must be cleared by software otherwise no new operation can be initiated. Software writes 1 to this bit has no effect and MAAER will maintain its original state.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>noError</name>
                  <description>No Error.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>error</name>
                  <description>Error.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AMS</name>
              <description>Multiplier A Memory Select. These bits select the starting position of the parameter 'a' within the logical segment specified by AMA.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>BMS</name>
              <description>Multiplicand B Memory Select. These bits select the starting position of the parameter 'b' within the logical segment specified by BMA.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EMS</name>
              <description>Exponent Memory Select. These bits select the starting position of the parameter 'e' within the logical segment specified by EMA.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>MMS</name>
              <description>Modulus Memory Select. These bits select the starting position of the parameter 'm' within the logical segment 5.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>AMA</name>
              <description>Multiplier / Operand A Memory Assignment. These bits select the logical cryptographic RAM segment for the parameter 'a'.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>BMA</name>
              <description>Multiplicand / Operand B Memory Assignment. These bits select the logical cryptographic RAM segment for the parameter 'b'.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>RMA</name>
              <description>Result Memory Assignment. These bits select the logical cryptographic RAM segment for the parameter 'r'.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>TMA</name>
              <description>Temporary Memory Assignment. These bits select the logical cryptographic RAM segment for the parameter 't'.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>4</dimIncrement>
          <name>DIN[%s]</name>
          <description>Crypto Data Input. Data input can be written to this register instead of using the DMA. This register writes to the FIFO. This register occupies four successive words to allow the use of multi-store instructions. Words can be written to any location, they will be placed in the FIFO in the order they are written. The endian swap input control bit affects this register.</description>
          <addressOffset>0x20</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>DATA</name>
              <description>Crypto Data Input. Input can be written to this register instead of using DMA.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>4</dimIncrement>
          <name>DOUT[%s]</name>
          <description>Crypto Data Output. Resulting data from cipher calculation. Data is placed in the lower words of these four registers depending on the algorithm. For block cipher modes, this register holds the result of most recent encryption or decryption operation. These registers are affected by the endian swap bits.</description>
          <addressOffset>0x30</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>DATA</name>
              <description>Crypto Data Output. Resulting data from cipher calculation. Data is placed in the lower words of these four registers depending on algorithm.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CRC_POLY</name>
          <description>CRC Polynomial. The polynomial to be used for Galois Field calculations (CRC or LFSR) should be written to this register. This register is affected by the MSB control bit.</description>
          <addressOffset>0x40</addressOffset>
          <resetValue>0xEDB88320</resetValue>
          <fields>
            <field>
              <name>POLY</name>
              <description>CRC Polynomial. The polynomial to be used for Galois Field calculations (CRC or LFSR) should be written to this register. This register is affected by the MSB control bit.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CRC_VAL</name>
          <description>CRC Value. This is the state for the Galois Field. This register holds the result of a CRC calculation or the current state of the LFSR. This register is affected by the MSB control bit.</description>
          <addressOffset>0x44</addressOffset>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>VAL</name>
              <description>CRC Value. This is the state for the Galois Field. This register holds the result of a CRC calculation or the current state of LFSR. This register is affected by the MSB control bit.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CRC_PRNG</name>
          <description>Pseudo Random Value. Output of the Galois Field shift register. This holds the resulting pseudo-random number if entropy is disabled or true random number if entropy is enabled.</description>
          <addressOffset>0x48</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>PRNG</name>
              <description>Pseudo Random Value. Output of the Galois Field Shift Register. This holds the resulting pseudo-random number if entropy is disabled or true random number if entropy is enabled.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HAM_ECC</name>
          <description>Hamming ECC Register.</description>
          <addressOffset>0x4C</addressOffset>
          <fields>
            <field>
              <name>ECC</name>
              <description>Hamming ECC Value. These bits are the even parity of their corresponding bit groups.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>PAR</name>
              <description>Parity. This is the parity of the entire array.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>even</name>
                  <description>Even.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>odd</name>
                  <description>Odd.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>4</dimIncrement>
          <name>CIPHER_INIT[%s]</name>
          <description>Initial Vector. For block cipher operations that use CBC, CFB, OFB, or CNTR modes, this register holds the initial value. This register is updated with each encryption or decryption operation. This register is affected by the endian swap bits.</description>
          <addressOffset>0x50</addressOffset>
          <fields>
            <field>
              <name>IVEC</name>
              <description>Initial Vector. For block cipher operations that use CBC, CFB, OFB, or CNTR modes, this register holds the initial value. This register is updated with each encryption or decryption operation. This register is affected by the endian swap bits.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>4</dimIncrement>
          <name>CIPHER_KEY[%s]</name>
          <description>Cipher Key. This register holds the key used for block cipher operations. The lower words are used for block ciphers that use shorter key lengths. This register is affected by the endian swap input control bits.</description>
          <addressOffset>0x60</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>KEY</name>
              <description>Cipher Key. This register holds the key used for block cipher operations. The lower words are used for block ciphers that use shorter kye lengths. This register is affected by the endian swap input control bits.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
