cmsis-svd/cmsis-svd/data/Maxim/max32650.svd
        <register>
          <dim>16</dim>
          <dimIncrement>4</dimIncrement>
          <name>HASH_DIGEST[%s]</name>
          <description>This register holds the calculated hash value. This register is affected by the endian swap bits.</description>
          <addressOffset>0x80</addressOffset>
          <fields>
            <field>
              <name>HASH</name>
              <description>This register holds the calculated hash value. This register is affected by the endian swap bits.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>4</dimIncrement>
          <name>HASH_MSG_SZ[%s]</name>
          <description>Message Size. This register holds the lowest 32-bit of message size in bytes.</description>
          <addressOffset>0xC0</addressOffset>
          <fields>
            <field>
              <name>MSGSZ</name>
              <description>Message Size. This register holds the lowest 32-bit of message size in bytes.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MAA_MAWS</name>
          <description>MAA Word Size. This register defines the number of bits for a modular operation. This register must be set to a valid value prior to the MAA operation start. Valid values are from 1 to 2048. Invalid values are ignored and will not initiate a MAA operation.</description>
          <addressOffset>0xD0</addressOffset>
          <fields>
            <field>
              <name>MAWS</name>
              <description>MAA Word Size.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <!--CRYPTO The Cryptographic Accelerator used to assist the computationally intensive operations of several common algorithms.-->
    <peripheral>
      <name>EMCC</name>
      <description>External Memory Cache Controller Registers.</description>
      <baseAddress>0x40033000</baseAddress>
      <addressBlock>
        <offset>0x00</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CACHE_ID</name>
          <description>Cache ID Register.</description>
          <addressOffset>0x0000</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>RELNUM</name>
              <description>Release Number. Identifies the RTL release version.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>PARTNUM</name>
              <description>Part Number. This field reflects the value of C_ID_PART_NUMBER configuration parameter.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>CCHID</name>
              <description>Cache ID. This field reflects the value of the C_ID_CACHEID configuration parameter.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MEMCFG</name>
          <description>Memory Configuration Register.</description>
          <addressOffset>0x0004</addressOffset>
          <access>read-only</access>
          <resetValue>0x00080008</resetValue>
          <fields>
            <field>
              <name>CCHSZ</name>
              <description>Cache Size. Indicates total size in Kbytes of cache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>MEMSZ</name>
              <description>Main Memory Size. Indicates the total size, in units of 128 Kbytes, of code memory accessible to the cache controller.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CACHE_CTRL</name>
          <description>Cache Control and Status Register.</description>
          <addressOffset>0x0100</addressOffset>
          <fields>
            <field>
              <name>CACHE_EN</name>
              <description>Cache Enable. Controls whether the cache is bypassed or is in use. Changing the state of this bit will cause the instruction cache to be flushed and its contents invalidated.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dis</name>
                  <description>Cache Bypassed. Instruction data is stored in the line fill buffer but is not written to main cache memory array.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>en</name>
                  <description>Cache Enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WRITE_ALLOC_EN</name>
              <description>Write Allocate Enable. This bit only writable while the cache is disabled.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dis</name>
                  <description>Write-no-allocate.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>en</name>
                  <description>Write-allocate enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CWFST_DIS</name>
              <description>Critical word first and streaming disable. This bit only writeable while the cache is disabled.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dis</name>
                  <description>Critical word first and streaming disabled.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>en</name>
                  <description>Critical word first and streaming enabled.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CACHE_RDY</name>
              <description>Cache Ready flag. Cleared by hardware when at any time the cache as a whole is invalidated (including a system reset). When this bit is 0, the cache is effectively in bypass mode (instruction fetches will come from main memory or from the line fill buffer). Set by hardware when the invalidate operation is complete and the cache is ready.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>notReady</name>
                  <description>Not Ready.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ready</name>
                  <description>Ready.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INVALIDATE</name>
          <description>Invalidate All Cache Contents. Any time this register location is written (regardless of the data value), the cache controller immediately begins invalidating the entire contents of the cache memory. The cache will be in bypass mode until the invalidate operation is complete. System software can examine the Cache Ready bit (CACHE_CTRL.CACHE_RDY) to determine when the invalidate operation is complete. Note that it is not necessary to disable the cache controller prior to beginning this operation. Reads from this register always return 0.</description>
          <addressOffset>0x0700</addressOffset>
          <fields>
            <field>
              <name>IA</name>
              <description>Invalidate all cache contents.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
