cmsis-svd/cmsis-svd/data/Maxim/max32650.svd
      </registers>
    </peripheral>
    <!--EMCC External Memory Cache Controller Registers.-->
    <peripheral>
      <name>DMA</name>
      <description>DMA Controller Fully programmable, chaining capable DMA channels.</description>
      <baseAddress>0x40028000</baseAddress>
      <size>32</size>
      <addressBlock>
        <offset>0x00</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>DMA0</name>
        <description>DMA Channel 0 IRQ</description>
        <value>28</value>
      </interrupt>
      <interrupt>
        <name>DMA1</name>
        <description>DMA Channel 1 IRQ</description>
        <value>29</value>
      </interrupt>
      <interrupt>
        <name>DMA2</name>
        <description>DMA Channel 2 IRQ</description>
        <value>30</value>
      </interrupt>
      <interrupt>
        <name>DMA3</name>
        <description>DMA Channel 3 IRQ</description>
        <value>31</value>
      </interrupt>
      <interrupt>
        <name>DMA4</name>
        <description>DMA Channel 4 IRQ</description>
        <value>68</value>
      </interrupt>
      <interrupt>
        <name>DMA5</name>
        <description>DMA Channel 5 IRQ</description>
        <value>69</value>
      </interrupt>
      <interrupt>
        <name>DMA6</name>
        <description>DMA Channel 6 IRQ</description>
        <value>70</value>
      </interrupt>
      <interrupt>
        <name>DMA7</name>
        <description>DMA Channel 7 IRQ</description>
        <value>71</value>
      </interrupt>
      <interrupt>
        <name>DMA8</name>
        <description>DMA Channel 8 IRQ</description>
        <value>72</value>
      </interrupt>
      <interrupt>
        <name>DMA9</name>
        <description>DMA Channel 9 IRQ</description>
        <value>73</value>
      </interrupt>
      <interrupt>
        <name>DMA10</name>
        <description>DMA Channel 10 IRQ</description>
        <value>74</value>
      </interrupt>
      <interrupt>
        <name>DMA11</name>
        <description>DMA Channel 11 IRQ</description>
        <value>75</value>
      </interrupt>
      <interrupt>
        <name>DMA12</name>
        <description>DMA Channel 12 IRQ</description>
        <value>76</value>
      </interrupt>
      <interrupt>
        <name>DMA13</name>
        <description>DMA Channel 13 IRQ</description>
        <value>77</value>
      </interrupt>
      <interrupt>
        <name>DMA14</name>
        <description>DMA Channel 14 IRQ</description>
        <value>78</value>
      </interrupt>
      <interrupt>
        <name>DMA15</name>
        <description>DMA Channel 15 IRQ</description>
        <value>79</value>
      </interrupt>
      <registers>
        <register>
          <name>CN</name>
          <description>DMA Control Register.</description>
          <addressOffset>0x000</addressOffset>
          <fields>
            <field>
              <name>CH0_IEN</name>
              <description>Channel 0 Interrupt Enable.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dis</name>
                  <description>Disable.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>en</name>
                  <description>Enable.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field derivedFrom="CH0_IEN">
              <name>CH1_IEN</name>
              <description>Channel 1 Interrupt Enable.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="CH0_IEN">
              <name>CH2_IEN</name>
              <description>Channel 2 Interrupt Enable.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="CH0_IEN">
              <name>CH3_IEN</name>
              <description>Channel 3 Interrupt Enable.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="CH0_IEN">
              <name>CH4_IEN</name>
              <description>Channel 4 Interrupt Enable.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="CH0_IEN">
              <name>CH5_IEN</name>
              <description>Channel 5 Interrupt Enable.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="CH0_IEN">
              <name>CH6_IEN</name>
              <description>Channel 6 Interrupt Enable.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="CH0_IEN">
              <name>CH7_IEN</name>
              <description>Channel 7 Interrupt Enable.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="CH0_IEN">
              <name>CH8_IEN</name>
              <description>Channel 8 Interrupt Enable.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="CH0_IEN">
              <name>CH9_IEN</name>
              <description>Channel 9 Interrupt Enable.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="CH0_IEN">
              <name>CH10_IEN</name>
              <description>Channel 10 Interrupt Enable.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="CH0_IEN">
              <name>CH11_IEN</name>
              <description>Channel 11 Interrupt Enable.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="CH0_IEN">
              <name>CH12_IEN</name>
              <description>Channel 12 Interrupt Enable.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="CH0_IEN">
              <name>CH13_IEN</name>
              <description>Channel 13 Interrupt Enable.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="CH0_IEN">
              <name>CH14_IEN</name>
              <description>Channel 14 Interrupt Enable.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="CH0_IEN">
              <name>CH15_IEN</name>
              <description>Channel 15 Interrupt Enable.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INTR</name>
          <description>DMA Interrupt Register.</description>
          <addressOffset>0x004</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>CH0_IPEND</name>
              <description>Channel Interrupt. To clear an interrupt, all active interrupt bits of the DMA_ST must be cleared. The interrupt bits are set only if their corresponding interrupt enable bits are set in DMA_CN.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>ch_ipend_enum</name>
                <enumeratedValue>
                  <name>inactive</name>
                  <description>No interrupt is pending.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pending</name>
                  <description>An interrupt is pending.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH1_IPEND</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="DMA.INTR.CH0_IPEND.ch_ipend_enum"></enumeratedValues>
            </field>
            <field>
              <name>CH2_IPEND</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="DMA.INTR.CH0_IPEND.ch_ipend_enum"></enumeratedValues>
            </field>
            <field>
              <name>CH3_IPEND</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="DMA.INTR.CH0_IPEND.ch_ipend_enum"></enumeratedValues>
            </field>
            <field>
              <name>CH4_IPEND</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="DMA.INTR.CH0_IPEND.ch_ipend_enum"></enumeratedValues>
            </field>
            <field>
              <name>CH5_IPEND</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="DMA.INTR.CH0_IPEND.ch_ipend_enum"></enumeratedValues>
            </field>
            <field>
              <name>CH6_IPEND</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="DMA.INTR.CH0_IPEND.ch_ipend_enum"></enumeratedValues>
            </field>
            <field>
              <name>CH7_IPEND</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="DMA.INTR.CH0_IPEND.ch_ipend_enum"></enumeratedValues>
            </field>
            <field>
              <name>CH8_IPEND</name>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="DMA.INTR.CH0_IPEND.ch_ipend_enum"></enumeratedValues>
            </field>
            <field>
              <name>CH9_IPEND</name>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="DMA.INTR.CH0_IPEND.ch_ipend_enum"></enumeratedValues>
            </field>
            <field>
              <name>CH10_IPEND</name>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="DMA.INTR.CH0_IPEND.ch_ipend_enum"></enumeratedValues>
            </field>
            <field>
              <name>CH11_IPEND</name>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="DMA.INTR.CH0_IPEND.ch_ipend_enum"></enumeratedValues>
            </field>
            <field>
              <name>CH12_IPEND</name>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="DMA.INTR.CH0_IPEND.ch_ipend_enum"></enumeratedValues>
            </field>
            <field>
              <name>CH13_IPEND</name>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="DMA.INTR.CH0_IPEND.ch_ipend_enum"></enumeratedValues>
            </field>
            <field>
              <name>CH14_IPEND</name>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="DMA.INTR.CH0_IPEND.ch_ipend_enum"></enumeratedValues>
            </field>
            <field>
              <name>CH15_IPEND</name>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="DMA.INTR.CH0_IPEND.ch_ipend_enum"></enumeratedValues>
            </field>
          </fields>
        </register>
