cmsis-svd/cmsis-svd/data/Maxim/max32650.svd
          <register>
            <name>ST</name>
            <description>DMA Channel Status Register.</description>
            <addressOffset>0x104</addressOffset>
            <fields>
              <field>
                <name>CH_ST</name>
                <description>Channel Status. This bit is used to indicate to the programmer when it is safe to change the configuration, address, and count registers for the channel. Whenever this bit is cleared by hardware, the DMA_CFG.CHEN bit is also cleared (if not cleared already).</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>dis</name>
                    <description>Disable.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>en</name>
                    <description>Enable.</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>IPEND</name>
                <description>Channel Interrupt.</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>inactive</name>
                    <description>No interrupt is pending.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>pending</name>
                    <description>An interrupt is pending.</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CTZ_ST</name>
                <description>Count-to-Zero (CTZ) Status</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <modifiedWriteValues>oneToClear</modifiedWriteValues>
                <enumeratedValues>
                  <name>ctz_st_enum_rd</name>
                  <usage>read</usage>
                  <enumeratedValue>
                    <name>noEvent</name>
                    <description>The event has not occurred.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>occurred</name>
                    <description>The event has occurred.</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
                <enumeratedValues>
                  <name>ctz_st_enum_wr</name>
                  <usage>write</usage>
                  <enumeratedValue>
                    <name>Clear</name>
                    <description>Clears the interrupt flag</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RLD_ST</name>
                <description>Reload Status.</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <modifiedWriteValues>oneToClear</modifiedWriteValues>
                <enumeratedValues>
                  <usage>read</usage>
                  <enumeratedValue>
                    <name>noEvent</name>
                    <description>The event has not occurred.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>occurred</name>
                    <description>The event has occurred.</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
                <enumeratedValues>
                  <usage>write</usage>
                  <enumeratedValue>
                    <name>Clear</name>
                    <description>Clears the interrupt flag</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>BUS_ERR</name>
                <description>Bus Error. Indicates that an AHB abort was received and the channel has been disabled.</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <modifiedWriteValues>oneToClear</modifiedWriteValues>
                <enumeratedValues>
                  <usage>read</usage>
                  <enumeratedValue>
                    <name>noEvent</name>
                    <description>The event has not occurred.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>occurred</name>
                    <description>The event has occurred.</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
                <enumeratedValues>
                  <usage>write</usage>
                  <enumeratedValue>
                    <name>Clear</name>
                    <description>Clears the interrupt flag</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TO_ST</name>
                <description>Time-Out Status.</description>
                <bitOffset>6</bitOffset>
                <bitWidth>1</bitWidth>
                <modifiedWriteValues>oneToClear</modifiedWriteValues>
                <enumeratedValues>
                  <usage>read</usage>
                  <enumeratedValue>
                    <name>noEvent</name>
                    <description>The event has not occurred.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>occurred</name>
                    <description>The event has occurred.</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
                <enumeratedValues>
                  <usage>write</usage>
                  <enumeratedValue>
                    <name>Clear</name>
                    <description>Clears the interrupt flag</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>SRC</name>
            <description>Source Device Address. If SRCINC=1, the counter bits are incremented by 1,2, or 4, depending on the data width of each AHB cycle. For peripheral transfers, some or all of the actual address bits are fixed. If SRCINC=0, this register remains constant. In the case where a count-to-zero condition occurs while RLDEN=1, the register is reloaded with the contents of DMA_SRC_RLD.</description>
            <addressOffset>0x108</addressOffset>
            <fields>
              <field>
                <name>ADDR</name>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
              </field>
            </fields>
          </register>
          <register>
            <name>DST</name>
            <description>Destination Device Address. For peripheral transfers, some or all of the actual address bits are fixed. If DSTINC=1, this register is incremented on every AHB write out of the DMA FIFO. They are incremented by 1, 2, or 4, depending on the data width of each AHB cycle. In the case where a count-to-zero condition occurs while RLDEN=1, the register is reloaded with DMA_DST_RLD.</description>
            <addressOffset>0x10C</addressOffset>
            <fields>
              <field>
                <name>ADDR</name>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
              </field>
            </fields>
          </register>
          <register>
            <name>CNT</name>
            <description>DMA Counter. The user loads this register with the number of bytes to transfer. This counter decreases on every AHB cycle into the DMA FIFO. The decrement will be 1, 2, or 4 depending on the data width of each AHB cycle. When the counter reaches 0, a count-to-zero condition is triggered.</description>
            <addressOffset>0x110</addressOffset>
            <fields>
              <field>
                <name>CNT</name>
                <description>DMA Counter.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>24</bitWidth>
              </field>
            </fields>
          </register>
          <register>
            <name>SRC_RLD</name>
            <description>Source Address Reload Value. The value of this register is loaded into DMA0_SRC upon a count-to-zero condition.</description>
            <addressOffset>0x114</addressOffset>
            <fields>
              <field>
                <name>SRC_RLD</name>
                <description>Source Address Reload Value.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>31</bitWidth>
              </field>
            </fields>
          </register>
          <register>
            <name>DST_RLD</name>
            <description>Destination Address Reload Value. The value of this register is loaded into DMA0_DST upon a count-to-zero condition.</description>
            <addressOffset>0x118</addressOffset>
            <fields>
              <field>
                <name>DST_RLD</name>
                <description>Destination Address Reload Value.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>31</bitWidth>
              </field>
            </fields>
          </register>
          <register>
            <name>CNT_RLD</name>
            <description>DMA Channel Count Reload Register.</description>
            <addressOffset>0x11C</addressOffset>
            <fields>
              <field>
                <name>CNT_RLD</name>
                <description>Count Reload Value. The value of this register is loaded into DMA0_CNT upon a count-to-zero condition.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>24</bitWidth>
              </field>
              <field>
                <name>RLDEN</name>
                <description>Reload Enable. This bit should be set after the address reload registers have been programmed. This bit is automatically cleared to 0 when reload occurs.</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>dis</name>
                    <description>Disable.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>en</name>
                    <description>Enable.</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
