cmsis-svd/cmsis-svd/data/Maxim/max32650.svd
      </registers>
    </peripheral>
    <!--FLC Flash Memory Control.-->
    <peripheral>
      <name>GCR</name>
      <description>Global Control Registers.</description>
      <baseAddress>0x40000000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>SCON</name>
          <description>System Control.</description>
          <addressOffset>0x00</addressOffset>
          <resetMask>0xFFFFFFFE</resetMask>
          <fields>
            <field>
              <name>BSTAPEN</name>
              <description>Boundary Scan TAP enable. When enabled, the JTAG port is connected to the Boundary Scan TAP. Otherwise, the port is connected to the ARM ICE function. This bit is reset by the POR. Reset value and access depend on the part number.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dis</name>
                  <description>Boundary Scan TAP port disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>en</name>
                  <description>Boundary Scan TAP port enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SBUSARB</name>
              <description>System bus abritration scheme. These bits are used to select between Fixed-burst abritration and Round-Robin scheme. The Round-Robin scheme is selected by default. These bits are reset by the system reset.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>fix</name>
                  <description>Fixed Burst abritration.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>round</name>
                  <description>Round-robin scheme.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLASH_PAGE_FLIP</name>
              <description>Flips the Flash bottom and top halves. (Depending on the total flash size, each half is either 256K or 512K). Initiating a flash page flip will cause a flush of both the data buffer on the DCODE bus and the internal instruction buffer.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>normal</name>
                  <description>Physical layout matches logical layout.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>swapped</name>
                  <description>Bottom half mapped to logical top half and vice versa.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CCACHE_FLUSH</name>
              <description>Code Cache Flush. This bit is used to flush the code caches and the instruction buffer of the Cortex-M4.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>normal</name>
                  <description>Normal Code Cache Operation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>flush</name>
                  <description>Code Caches and CPU instruction buffer are flushed</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCACHE_FLUSH</name>
              <description>Data Cache Flush. The system cache(s) will be flushed when this bit is set.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>normal</name>
                  <description>Normal System Cache Operation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>flush</name>
                  <description>System Cache is flushed</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCACHE_DIS</name>
              <description>Data Cache Disable. The system cache(s) will be completely disabled when this bit is set.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>en</name>
                  <description>Is enabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dis</name>
                  <description>Is Disabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CCHK</name>
              <description>Compute ROM Checksum. This bit is self-cleared when calculation is completed. Once set, software clearing this bit is ignored and the bit will remain set until the operation is completed.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>complete</name>
                  <description>No operation/complete.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>start</name>
                  <description>Start operation.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CHKRES</name>
              <description>ROM Checksum Result. This bit is only valid when CHKRD=1.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>pass</name>
                  <description>ROM Checksum Correct.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>fail</name>
                  <description>ROM Checksum Fail.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OVR</name>
              <description>Operating Voltage Range. Setting these bits according to the VCore voltage allows the on-chip Random-Access memories to operate in their optimal timing range.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0_9V</name>
                  <description>0.9V +/- 10 Percent</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1_0V</name>
                  <description>1.0V +/- 10 Percent</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1_1V</name>
                  <description>1.1V +/- 10 Percent</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
