cmsis-svd/cmsis-svd/data/Maxim/max32650.svd
        <register>
          <name>RSTR0</name>
          <description>Reset.</description>
          <addressOffset>0x04</addressOffset>
          <fields>
            <field>
              <name>DMA</name>
              <description>DMA Reset.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>dma_write</name>
                <usage>write</usage>
                <enumeratedValue>
                  <name>RFU</name>
                  <description>Reserved. Do not use.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>reset</name>
                  <description>Starts reset operation.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <name>dma_read</name>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Reset_Done</name>
                  <description>Reset Complete</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Busy</name>
                  <description>Reset Busy</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WDT</name>
              <description>Watchdog Timer Reset.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>wdt_write</name>
                <usage>write</usage>
                <enumeratedValue>
                  <name>RFU</name>
                  <description>Reserved. Do not use.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>reset</name>
                  <description>Starts reset operation.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <name>wdt_read</name>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Reset_Done</name>
                  <description>Reset Complete</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Busy</name>
                  <description>Reset Busy</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO0</name>
              <description>GPIO0 Reset. Setting this bit to 1 resets GPIO0 pins to their default states.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>gpio0_write</name>
                <usage>write</usage>
                <enumeratedValue>
                  <name>RFU</name>
                  <description>Reserved. Do not use.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>reset</name>
                  <description>Starts reset operation.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <name>gpio0_read</name>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Reset_Done</name>
                  <description>Reset Complete</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Busy</name>
                  <description>Reset Busy</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO1</name>
              <description>GPIO1 Reset. Setting this bit to 1 resets GPIO1 pins to their default states.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>gpio1_write</name>
                <usage>write</usage>
                <enumeratedValue>
                  <name>RFU</name>
                  <description>Reserved. Do not use.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>reset</name>
                  <description>Starts reset operation.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <name>gpio1_read</name>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Reset_Done</name>
                  <description>Reset Complete</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Busy</name>
                  <description>Reset Busy</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO2</name>
              <description>GPIO2 Reset. Setting this bit to 1 resets GPIO2 pins to their default states.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>gpio2_write</name>
                <usage>write</usage>
                <enumeratedValue>
                  <name>RFU</name>
                  <description>Reserved. Do not use.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>reset</name>
                  <description>Starts reset operation.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <name>gpio2_read</name>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Reset_Done</name>
                  <description>Reset Complete</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Busy</name>
                  <description>Reset Busy</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIMER0</name>
              <description>Timer0 Reset. Setting this bit to 1 resets Timer 0 blocks.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>timer0_write</name>
                <usage>write</usage>
                <enumeratedValue>
                  <name>RFU</name>
                  <description>Reserved. Do not use.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>reset</name>
                  <description>Starts reset operation.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <name>timer0_read</name>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Reset_Done</name>
                  <description>Reset Complete</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Busy</name>
                  <description>Reset Busy</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIMER1</name>
              <description>Timer1 Reset. Setting this bit to 1 resets Timer 1 blocks.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>timer1_write</name>
                <usage>write</usage>
                <enumeratedValue>
                  <name>RFU</name>
                  <description>Reserved. Do not use.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>reset</name>
                  <description>Starts reset operation.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <name>timer1_read</name>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Reset_Done</name>
                  <description>Reset Complete</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Busy</name>
                  <description>Reset Busy</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIMER2</name>
              <description>Timer2 Reset. Setting this bit to 1 resets Timer 2 blocks.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>timer2_write</name>
                <usage>write</usage>
                <enumeratedValue>
                  <name>RFU</name>
                  <description>Reserved. Do not use.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>reset</name>
                  <description>Starts reset operation.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <name>timer2_read</name>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Reset_Done</name>
                  <description>Reset Complete</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Busy</name>
                  <description>Reset Busy</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIMER3</name>
              <description>Timer3 Reset. Setting this bit to 1 resets Timer 3 blocks.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>timer3_write</name>
                <usage>write</usage>
                <enumeratedValue>
                  <name>RFU</name>
                  <description>Reserved. Do not use.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>reset</name>
                  <description>Starts reset operation.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <name>timer3_read</name>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Reset_Done</name>
                  <description>Reset Complete</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Busy</name>
                  <description>Reset Busy</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIMER4</name>
              <description>Timer3 Reset. Setting this bit to 1 resets Timer 4 blocks.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>timer4_write</name>
                <usage>write</usage>
                <enumeratedValue>
                  <name>RFU</name>
                  <description>Reserved. Do not use.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>reset</name>
                  <description>Starts reset operation.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <name>timer4_read</name>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Reset_Done</name>
                  <description>Reset Complete</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Busy</name>
                  <description>Reset Busy</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIMER5</name>
              <description>Timer3 Reset. Setting this bit to 1 resets Timer 5 blocks.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>timer5_write</name>
                <usage>write</usage>
                <enumeratedValue>
                  <name>RFU</name>
                  <description>Reserved. Do not use.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>reset</name>
                  <description>Starts reset operation.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <name>timer5_read</name>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Reset_Done</name>
                  <description>Reset Complete</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Busy</name>
                  <description>Reset Busy</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UART0</name>
              <description>UART0 Reset. Setting this bit to 1 resets all UART 0 blocks.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>uart0_write</name>
                <usage>write</usage>
                <enumeratedValue>
                  <name>RFU</name>
                  <description>Reserved. Do not use.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>reset</name>
                  <description>Starts reset operation.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <name>uart0_read</name>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Reset_Done</name>
                  <description>Reset Complete</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Busy</name>
                  <description>Reset Busy</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UART1</name>
              <description>UART1 Reset. Setting this bit to 1 resets all UART 1 blocks.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>uart1_write</name>
                <usage>write</usage>
                <enumeratedValue>
                  <name>RFU</name>
                  <description>Reserved. Do not use.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>reset</name>
                  <description>Starts reset operation.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <name>uart1_read</name>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Reset_Done</name>
                  <description>Reset Complete</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Busy</name>
                  <description>Reset Busy</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SPI0</name>
              <description>SPI0 Reset. Setting this bit to 1 resets all SPI 0 blocks.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>spi0_write</name>
                <usage>write</usage>
                <enumeratedValue>
                  <name>RFU</name>
                  <description>Reserved. Do not use.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>reset</name>
                  <description>Starts reset operation.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <name>spi0_read</name>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Reset_Done</name>
                  <description>Reset Complete</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Busy</name>
                  <description>Reset Busy</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SPI1</name>
              <description>SPI1 Reset. Setting this bit to 1 resets all SPI 1 blocks.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>spi1_write</name>
                <usage>write</usage>
                <enumeratedValue>
                  <name>RFU</name>
                  <description>Reserved. Do not use.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>reset</name>
                  <description>Starts reset operation.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <name>xpi1_read</name>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Reset_Done</name>
                  <description>Reset Complete</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Busy</name>
                  <description>Reset Busy</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SPI2</name>
              <description>SPI2 Reset. Setting this bit to 1 resets all SPI 2 blocks.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>spi2_write</name>
                <usage>write</usage>
                <enumeratedValue>
                  <name>RFU</name>
                  <description>Reserved. Do not use.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>reset</name>
                  <description>Starts reset operation.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <name>spi2_read</name>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Reset_Done</name>
                  <description>Reset Complete</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Busy</name>
                  <description>Reset Busy</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>I2C0</name>
              <description>I2C0 Reset.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>i2c0_write</name>
                <usage>write</usage>
                <enumeratedValue>
                  <name>RFU</name>
                  <description>Reserved. Do not use.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>reset</name>
                  <description>Starts reset operation.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <name>i2c0_read</name>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Reset_Done</name>
                  <description>Reset Complete</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Busy</name>
                  <description>Reset Busy</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RTC</name>
              <description>Real Time Clock Reset.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>rtc_write</name>
                <usage>write</usage>
                <enumeratedValue>
                  <name>RFU</name>
                  <description>Reserved. Do not use.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>reset</name>
                  <description>Starts reset operation.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <name>rtc_read</name>
                <usage>read</usage>
