cmsis-svd/cmsis-svd/data/Maxim/max32650.svd
                <enumeratedValue>
                  <name>Reset_Done</name>
                  <description>Reset Complete</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Busy</name>
                  <description>Reset Busy</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CRYPTO</name>
              <description>Cryptographic Reset. Setting this bit to 1 resets the AES block, the SHA block and the DES block.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>crypto_write</name>
                <usage>write</usage>
                <enumeratedValue>
                  <name>RFU</name>
                  <description>Reserved. Do not use.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>reset</name>
                  <description>Starts reset operation.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <name>crypto_read</name>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Reset_Done</name>
                  <description>Reset Complete</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Busy</name>
                  <description>Reset Busy</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HBC</name>
              <description>Hyper Bus Controller Reset. Setting this bit to 1 resets the HBC clock.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>hbc_write</name>
                <usage>write</usage>
                <enumeratedValue>
                  <name>RFU</name>
                  <description>Reserved. Do not use.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>reset</name>
                  <description>Starts reset operation.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <name>hbc_read</name>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Reset_Done</name>
                  <description>Reset Complete</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Busy</name>
                  <description>Reset Busy</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLCD</name>
              <description>CLCD Reset. Setting this bit to 1 resets the CLCD clock.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>clcd_write</name>
                <usage>write</usage>
                <enumeratedValue>
                  <name>RFU</name>
                  <description>Reserved. Do not use.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>reset</name>
                  <description>Starts reset operation.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <name>clcd_read</name>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Reset_Done</name>
                  <description>Reset Complete</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Busy</name>
                  <description>Reset Busy</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USB</name>
              <description>USB Reset. Setting this bit resets both USB blocks.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>usb_write</name>
                <usage>write</usage>
                <enumeratedValue>
                  <name>RFU</name>
                  <description>Reserved. Do not use.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>reset</name>
                  <description>Starts reset operation.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <name>usb_read</name>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Reset_Done</name>
                  <description>Reset Complete</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Busy</name>
                  <description>Reset Busy</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRNG</name>
              <description>TRNG Reset.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>trng_write</name>
                <usage>write</usage>
                <enumeratedValue>
                  <name>RFU</name>
                  <description>Reserved. Do not use.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>reset</name>
                  <description>Starts reset operation.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <name>trng_read</name>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Reset_Done</name>
                  <description>Reset Complete</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Busy</name>
                  <description>Reset Busy</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RSV_0x19</name>
              <description>Reserved for Future Use</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ADC</name>
              <description>Analog to Digital Reset.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>adc_write</name>
                <usage>write</usage>
                <enumeratedValue>
                  <name>RFU</name>
                  <description>Reserved. Do not use.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>reset</name>
                  <description>Starts reset operation.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <name>adc_read</name>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Reset_Done</name>
                  <description>Reset Complete</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Busy</name>
                  <description>Reset Busy</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UART2</name>
              <description>UART2 Reset. Setting this bit to 1 resets all UART 2 blocks.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>uart2_write</name>
                <usage>write</usage>
                <enumeratedValue>
                  <name>RFU</name>
                  <description>Reserved. Do not use.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>reset</name>
                  <description>Starts reset operation.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <name>uart2_read</name>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Reset_Done</name>
                  <description>Reset Complete</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Busy</name>
                  <description>Reset Busy</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRST</name>
              <description>Soft Reset. Setting this bit to 1 resets everything except the CPU and the watchdog timer.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>srst_write</name>
                <usage>write</usage>
                <enumeratedValue>
                  <name>RFU</name>
                  <description>Reserved. Do not use.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>reset</name>
                  <description>Starts reset operation.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <name>srst_read</name>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Reset_Done</name>
                  <description>Reset Complete</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Busy</name>
                  <description>Reset Busy</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRST</name>
              <description>Peripheral Reset. Setting this bit to 1 resets all peripherals. The CPU core, the watchdog timer, and all GPIO pins are unaffected by this reset.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>prst_write</name>
                <usage>write</usage>
                <enumeratedValue>
                  <name>RFU</name>
                  <description>Reserved. Do not use.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>reset</name>
                  <description>Starts reset operation.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <name>prst_read</name>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Reset_Done</name>
                  <description>Reset Complete</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Busy</name>
                  <description>Reset Busy</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYSTEM</name>
              <description>System Reset. Setting this bit to 1 resets the CPU core and all peripherals, including the watchdog timer.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>system_write</name>
                <usage>write</usage>
                <enumeratedValue>
                  <name>RFU</name>
                  <description>Reserved. Do not use.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>reset</name>
                  <description>Starts reset operation.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <name>system_read</name>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Reset_Done</name>
                  <description>Reset Complete</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Busy</name>
                  <description>Reset Busy</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
