cmsis-svd/cmsis-svd/data/Maxim/max32650.svd
        <register>
          <name>CLKCN</name>
          <description>Clock Control.</description>
          <addressOffset>0x08</addressOffset>
          <resetValue>0x00000008</resetValue>
          <fields>
            <field>
              <name>PSC</name>
              <description>Prescaler Select. This 3 bit field sets the system operating frequency by controlling the prescaler that divides the output of the PLL0.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>div1</name>
                  <description>Divide by 1.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>div2</name>
                  <description>Divide by 2.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>div4</name>
                  <description>Divide by 4.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>div8</name>
                  <description>Divide by 8.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>div16</name>
                  <description>Divide by 16.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>div32</name>
                  <description>Divide by 32.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>div64</name>
                  <description>Divide by 64.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>div128</name>
                  <description>Divide by 128.</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLKSEL</name>
              <description>Clock Source Select. This 3 bit field selects the source for the system clock.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>cryptoOsc</name>
                  <description>Crypto oscillator is used for the system clock.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>hfxIn</name>
                  <description>HFXIN is used for the system clock.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>nanoRing</name>
                  <description>The nano-ring output is used for the system clock.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIRC96</name>
                  <description>The internal 96 MHz oscillator is used for the system clock.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIRC8</name>
                  <description>The internal 8 MHz oscillator is used for the system clock.</description>
                  <value>5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CKRDY</name>
              <description>Clock Ready. This read only bit reflects whether the currently selected system clock source is running.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>busy</name>
                  <description>Switchover to the new clock source (as selected by CLKSEL) has not yet occurred.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ready</name>
                  <description>System clock running from CLKSEL clock source.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CCD</name>
              <description>Cryptographic clock divider</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>non_div</name>
                  <description>The cryptographic accelerator clock is running in non-divided mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>div</name>
                  <description>The cryptographic accelerator clock is running in divided mode.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>X32K_EN</name>
              <description>32kHz Crystal Oscillator Enable.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dis</name>
                  <description>Is Disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>en</name>
                  <description>Is Enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HIRC_EN</name>
              <description>60MHz High Frequency Internal Reference Clock Enable.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dis</name>
                  <description>Is Disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>en</name>
                  <description>Is Enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HIRC96M_EN</name>
              <description>96MHz High Frequency Internal Reference Clock Enable.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dis</name>
                  <description>Is Disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>en</name>
                  <description>Is Enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HIRC8M_EN</name>
              <description>8MHz High Frequency Internal Reference Clock Enable.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dis</name>
                  <description>Is Disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>en</name>
                  <description>Is Enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>X32K_RDY</name>
              <description>32kHz Crystal Oscillator Ready</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>not</name>
                  <description>Not Ready</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Ready</name>
                  <description>X32K Ready</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HIRC_RDY</name>
              <description>60MHz HIRC Ready.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>not</name>
                  <description>Not Ready</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ready</name>
                  <description>HIRC Ready</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HIRC96M_RDY</name>
              <description>96MHz HIRC Ready.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>not</name>
                  <description>Not Ready</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ready</name>
                  <description>HIRC96M Ready</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HIRC8M_RDY</name>
              <description>8MHz HIRC Ready.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>not</name>
                  <description>Not Ready</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ready</name>
                  <description>HIRC8M Ready</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LIRC8K_RDY</name>
              <description>8kHz Low Frequency Reference Clock Ready.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>not</name>
                  <description>Not Ready</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ready</name>
                  <description>Clock Ready</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PM</name>
          <description>Power Management.</description>
          <addressOffset>0x0C</addressOffset>
          <fields>
            <field>
              <name>MODE</name>
              <description>Operating Mode. This two bit field selects the current operating mode for the device. Note that code execution only occurs during ACTIVE mode.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>active</name>
                  <description>Active Mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>shutdown</name>
                  <description>Shutdown Mode.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>backup</name>
                  <description>Backup Mode.</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIOWKEN</name>
              <description>GPIO Wake Up Enable. This bit enables all GPIO pins as potential wakeup sources. Any GPIO configured for wakeup is capable of causing an exit from IDLE or STANDBY modes when this bit is set.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dis</name>
                  <description>Wake Up Disable.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>en</name>
                  <description>Wake Up Enable.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RTCWKEN</name>
              <description>RTC Alarm Wake Up Enable. This bit enables RTC alarm as wakeup source. If enabled, the desired RTC alarm must be configured via the RTC control registers.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dis</name>
                  <description>Wake Up Disable.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>en</name>
                  <description>Wake Up Enable.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USBWKEN</name>
              <description>USB Wake Up Enable. This bit enables USB activity as wakeup source.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dis</name>
                  <description>Wake Up Disable.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>en</name>
                  <description>Wake Up Enable.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HIRCPD</name>
              <description>HIRC Power Down. This bit selects HIRC power state in DEEPSLEEP mode.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>active</name>
                  <description>Mode is Active.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>deepsleep</name>
                  <description>Powered down in DEEPSLEEP.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HIRC96MPD</name>
              <description>96MHz power down. This bit selects 96MHz HIRC power state in DEEPSLEEP mode.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>active</name>
                  <description>Mode is Active.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>deepsleep</name>
                  <description>Powered down in DEEPSLEEP.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HIRC8MPD</name>
              <description>8MHz power down. This bit selects 8MHz HIRC power state in DEEPSLEEP mode.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>active</name>
                  <description>Mode is Active.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>deepsleep</name>
                  <description>Powered down in DEEPSLEEP.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PLL0CN</name>
          <description>PLL 0 Control.</description>
          <addressOffset>0x10</addressOffset>
          <fields>
            <field>
              <name>RFU</name>
              <description>Reserved for Future Use</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PLL1CN</name>
          <description>PLL 1 Control.</description>
          <addressOffset>0x14</addressOffset>
          <fields>
            <field>
              <name>RFU</name>
              <description>Reserved for Future Use</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PCKDIV</name>
          <description>Peripheral Clock Divider.</description>
          <addressOffset>0x18</addressOffset>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>PCF</name>
              <description>These bits determine the clock frequency for the UART, I2C and Key Pad peripherals. These peripherals have an adaptive clock generator that dynamically adjusts the peripheral frequency based on the main system bus frequency. These bits are dynamically updated when the PLL0 is selected as the system clock source and are set by hardware. These bits determine the clock frequency for the UART, I2C and Key Pad peripherals. These peripherals have an adaptive clock generator that dynamically adjusts the peripheral frequency based on the main system bus frequency. These bits are dynamically updated when the PLL0 is selected as the system clock source and are set by hardware.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>96MHz</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>48MHz</name>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>24MHz</name>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>12MHz</name>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6MHz</name>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3MHz</name>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PCFWEN</name>
              <description>PCF Write Enable. This bit allows the PCF Register bits to be updated by Software.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>blocked</name>
                  <description>Writes to PCF are blocked.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>allowed</name>
                  <description>Writes to PCF are allowed</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SDHCFRQ</name>
              <description>SDHC Clock Frequency. This bits defines the clock frequency of SDHC.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>48MHz</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>24MHz</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADCFRQ</name>
              <description>ADC clock Frequency. These bits define the ADC clock frequency. FADC = FPCLK/(ADCFRQ).</description>
              <bitOffset>10</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>AONCD</name>
              <description>Always-ON(AON) domain CLock Divider. These bits define the AON domain clock divider.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>div_4</name>
                  <description>PCLK divide by 4.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>div_8</name>
                  <description>PCLK divide by 8.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>div_16</name>
                  <description>PCLK divide by 16.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>div_32</name>
                  <description>PCLK divide by 32.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
