cmsis-svd/cmsis-svd/data/Maxim/max32650.svd
        <register>
          <name>PERCKCN0</name>
          <description>Peripheral Clock Disable.</description>
          <addressOffset>0x24</addressOffset>
          <fields>
            <field>
              <name>GPIO0D</name>
              <description>GPIO0 Disable.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>GPIODisable</name>
                <enumeratedValue>
                  <name>en</name>
                  <description>enable it.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dis</name>
                  <description>disable it.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO1D</name>
              <description>GPIO1 Disable.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>GPIODisable</name>
                <enumeratedValue>
                  <name>en</name>
                  <description>enable it.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dis</name>
                  <description>disable it.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO2D</name>
              <description>GPIO2 Disable.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>GPIODisable</name>
                <enumeratedValue>
                  <name>en</name>
                  <description>enable it.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dis</name>
                  <description>disable it.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USBD</name>
              <description>USB Disable.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>GPIODisable</name>
                <enumeratedValue>
                  <name>en</name>
                  <description>enable it.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dis</name>
                  <description>disable it.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLCDD</name>
              <description>CLCD Disable.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>GPIODisable</name>
                <enumeratedValue>
                  <name>en</name>
                  <description>enable it.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dis</name>
                  <description>disable it.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMAD</name>
              <description>DMA Disable.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>GPIODisable</name>
                <enumeratedValue>
                  <name>en</name>
                  <description>enable it.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dis</name>
                  <description>disable it.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SPI0D</name>
              <description>SPI 0 Disable.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>GPIODisable</name>
                <enumeratedValue>
                  <name>en</name>
                  <description>enable it.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dis</name>
                  <description>disable it.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SPI1D</name>
              <description>SPI 1 Disable.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>GPIODisable</name>
                <enumeratedValue>
                  <name>en</name>
                  <description>enable it.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dis</name>
                  <description>disable it.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SPI2D</name>
              <description>SPI 2 Disable.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>GPIODisable</name>
                <enumeratedValue>
                  <name>en</name>
                  <description>enable it.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dis</name>
                  <description>disable it.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UART0D</name>
              <description>UART 0 Disable.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>GPIODisable</name>
                <enumeratedValue>
                  <name>en</name>
                  <description>enable it.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dis</name>
                  <description>disable it.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UART1D</name>
              <description>UART 1 Disable.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>GPIODisable</name>
                <enumeratedValue>
                  <name>en</name>
                  <description>enable it.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dis</name>
                  <description>disable it.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>I2C0D</name>
              <description>I2C 0 Disable.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>GPIODisable</name>
                <enumeratedValue>
                  <name>en</name>
                  <description>enable it.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dis</name>
                  <description>disable it.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CRYPTOD</name>
              <description>Crypto Disable.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>GPIODisable</name>
                <enumeratedValue>
                  <name>en</name>
                  <description>enable it.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dis</name>
                  <description>disable it.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>T0D</name>
              <description>Timer 0 Disable.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>GPIODisable</name>
                <enumeratedValue>
                  <name>en</name>
                  <description>enable it.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dis</name>
                  <description>disable it.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>T1D</name>
              <description>Timer 1 Disable.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>GPIODisable</name>
                <enumeratedValue>
                  <name>en</name>
                  <description>enable it.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dis</name>
                  <description>disable it.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>T2D</name>
              <description>Timer 2 Disable.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>GPIODisable</name>
                <enumeratedValue>
                  <name>en</name>
                  <description>enable it.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dis</name>
                  <description>disable it.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>T3D</name>
              <description>Timer 3 Disable.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>GPIODisable</name>
                <enumeratedValue>
                  <name>en</name>
                  <description>enable it.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dis</name>
                  <description>disable it.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>T4D</name>
              <description>Timer 4 Disable.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>GPIODisable</name>
                <enumeratedValue>
                  <name>en</name>
                  <description>enable it.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dis</name>
                  <description>disable it.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>T5D</name>
              <description>Timer 5 Disable.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>GPIODisable</name>
                <enumeratedValue>
                  <name>en</name>
                  <description>enable it.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dis</name>
                  <description>disable it.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADCD</name>
              <description>ADC Disable.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>GPIODisable</name>
                <enumeratedValue>
                  <name>en</name>
                  <description>enable it.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dis</name>
                  <description>disable it.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RSV_0X19</name>
              <description>Reserved for Future Use</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I2C1D</name>
              <description>I2C 1 Disable.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>GPIODisable</name>
                <enumeratedValue>
                  <name>en</name>
                  <description>enable it.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dis</name>
                  <description>disable it.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PTD</name>
              <description>PT Clock Disable.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>GPIODisable</name>
                <enumeratedValue>
                  <name>en</name>
                  <description>enable it.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dis</name>
                  <description>disable it.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SPIXIPD</name>
              <description>SPI XiP Disable.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>GPIODisable</name>
                <enumeratedValue>
                  <name>en</name>
                  <description>enable it.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dis</name>
                  <description>disable it.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SPIMD</name>
              <description>SPI XiP Master Controller Disable.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>GPIODisable</name>
                <enumeratedValue>
                  <name>en</name>
                  <description>enable it.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dis</name>
                  <description>disable it.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
