cmsis-svd/cmsis-svd/data/Maxim/max32650.svd
        <register>
          <name>MEMCKCN</name>
          <description>Memory Clock Control Register.</description>
          <addressOffset>0x28</addressOffset>
          <fields>
            <field>
              <name>FWS</name>
              <description>Flash Wait State. These bits define the number of wait-state cycles per Flash data read access. Minimum wait state is 2.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SYSRAM0LS</name>
              <description>System RAM 0 Light Sleep Mode.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>active</name>
                  <description>Memory is active.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>light_sleep</name>
                  <description>Memory is in Light Sleep mode.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYSRAM1LS</name>
              <description>System RAM 1 Light Sleep Mode.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>active</name>
                  <description>Memory is active.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>light_sleep</name>
                  <description>Memory is in Light Sleep mode.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYSRAM2LS</name>
              <description>System RAM 2 Light Sleep Mode.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>active</name>
                  <description>Memory is active.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>light_sleep</name>
                  <description>Memory is in Light Sleep mode.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYSRAM3LS</name>
              <description>System RAM 3 Light Sleep Mode.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>active</name>
                  <description>Memory is active.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>light_sleep</name>
                  <description>Memory is in Light Sleep mode.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYSRAM4LS</name>
              <description>System RAM 4 Light Sleep Mode.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>active</name>
                  <description>Memory is active.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>light_sleep</name>
                  <description>Memory is in Light Sleep mode.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYSRAM5LS</name>
              <description>System RAM 5 Light Sleep Mode.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>active</name>
                  <description>Memory is active.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>light_sleep</name>
                  <description>Memory is in Light Sleep mode.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYSRAM6LS</name>
              <description>System RAM 6 Light Sleep Mode.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>active</name>
                  <description>Memory is active.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>light_sleep</name>
                  <description>Memory is in Light Sleep mode.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ICACHELS</name>
              <description>ICache RAM Light Sleep Mode.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>active</name>
                  <description>Memory is active.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>light_sleep</name>
                  <description>Memory is in Light Sleep mode.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ICACHEXIPLS</name>
              <description>ICACHE-XIP RAM Light Sleep Mode.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>active</name>
                  <description>Memory is active.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>light_sleep</name>
                  <description>Memory is in Light Sleep mode.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SCACHELS</name>
              <description>SysCache RAM Light Sleep Mode.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>active</name>
                  <description>Memory is active.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>light_sleep</name>
                  <description>Memory is in Light Sleep mode.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CRYPTOLS</name>
              <description>CRYPTO RAM Light Sleep Mode.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>active</name>
                  <description>Memory is active.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>light_sleep</name>
                  <description>Memory is in Light Sleep mode.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USBLS</name>
              <description>USB FIFO Light Sleep Mode.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>active</name>
                  <description>Memory is active.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>light_sleep</name>
                  <description>Memory is in Light Sleep mode.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ROMLS</name>
              <description>ROM Light Sleep Mode.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>active</name>
                  <description>Memory is active.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>light_sleep</name>
                  <description>Memory is in Light Sleep mode.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MEMZCN</name>
          <description>Memory Zeroize Control.</description>
          <addressOffset>0x2C</addressOffset>
          <fields>
            <field>
              <name>SRAM0Z</name>
              <description>System RAM Block 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nop</name>
                  <description>No operation/complete.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>start</name>
                  <description>Start operation.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM1Z</name>
              <description>System RAM Block 1.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nop</name>
                  <description>No operation/complete.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>start</name>
                  <description>Start operation.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM2Z</name>
              <description>System RAM Block 2.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nop</name>
                  <description>No operation/complete.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>start</name>
                  <description>Start operation.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM3Z</name>
              <description>System RAM Block 3.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nop</name>
                  <description>No operation/complete.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>start</name>
                  <description>Start operation.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM4Z</name>
              <description>System RAM Block 4.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nop</name>
                  <description>No operation/complete.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>start</name>
                  <description>Start operation.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM5Z</name>
              <description>System RAM Block 5.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nop</name>
                  <description>No operation/complete.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>start</name>
                  <description>Start operation.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM6Z</name>
              <description>System RAM Block 6.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nop</name>
                  <description>No operation/complete.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>start</name>
                  <description>Start operation.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ICACHEZ</name>
              <description>Instruction Cache.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nop</name>
                  <description>No operation/complete.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>start</name>
                  <description>Start operation.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ICACHEXIPZ</name>
              <description>Instruction Cache XIP Data and Tag Ram zeroizatoin.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nop</name>
                  <description>No operation/complete.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>start</name>
                  <description>Start operation.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SCACHEDATAZ</name>
              <description>System Cache Data Ram Zeroization.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nop</name>
                  <description>No operation/complete.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>start</name>
                  <description>Start operation.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SCACHETAGZ</name>
              <description>System Cache Tag Zeroization.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nop</name>
                  <description>No operation/complete.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>start</name>
                  <description>Start operation.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CRYPTOZ</name>
              <description>Crypto (MAA) Memory.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nop</name>
                  <description>No operation/complete.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>start</name>
                  <description>Start operation.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USBFIFOZ</name>
              <description>USB FIFO Zeroizatoin.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nop</name>
                  <description>No operation/complete.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>start</name>
                  <description>Start operation.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SCCK</name>
          <description>Smart Card Clock Control.</description>
          <addressOffset>0x34</addressOffset>
          <resetValue>0x00001414</resetValue>
        </register>
        <register>
          <name>MPRI0</name>
          <description>Master Priority Control Register 0.</description>
          <addressOffset>0x38</addressOffset>
          <resetValue>0x00001414</resetValue>
        </register>
        <register>
          <name>MPRI1</name>
          <description>Mater Priority Control Register 1.</description>
          <addressOffset>0x3C</addressOffset>
          <resetValue>0x00001414</resetValue>
        </register>
        <register>
          <name>SYSST</name>
          <description>System Status Register.</description>
          <addressOffset>0x40</addressOffset>
          <fields>
            <field>
              <name>ICECLOCK</name>
              <description>ARM ICE Lock Status.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>unlocked</name>
                  <description>ICE is unlocked.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>locked</name>
                  <description>ICE is locked.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CODEINTERR</name>
              <description>Code Integrity Error Flag. This bit indicates a code integrity error has occured in XiP interface.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>norm</name>
                  <description>Normal Operating Condition.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>code</name>
                  <description>Code Integrity Error.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SCMEMF</name>
              <description>System Cache Memory Fault Flag. This bit indicates a memory fault has occured in the System Cache while receiving data from the Hyperbus Interface.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>norm</name>
                  <description>Normal Operating Condition.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>memory</name>
                  <description>Memory Fault.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
