cmsis-svd/cmsis-svd/data/Maxim/max32650.svd
        <register>
          <name>RSTR1</name>
          <description>Reset 1.</description>
          <addressOffset>0x44</addressOffset>
          <fields>
            <field>
              <name>I2C1</name>
              <description>I2C1 Reset.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>reset_write</name>
                <usage>write</usage>
                <enumeratedValue>
                  <name>RFU</name>
                  <description>Reserved. Do not use.</description>
                  <isDefault>true</isDefault>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>reset</name>
                  <description>Starts reset operation.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <name>reset_read</name>
                <usage>read</usage>
                <enumeratedValue>
                  <name>reset_done</name>
                  <description>Reset complete.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>busy</name>
                  <description>Reset in progress.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PT</name>
              <description>PT Reset.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>reset_write</name>
                <usage>write</usage>
                <enumeratedValue>
                  <name>RFU</name>
                  <description>Reserved. Do not use.</description>
                  <isDefault>true</isDefault>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>reset</name>
                  <description>Starts reset operation.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <name>reset_read</name>
                <usage>read</usage>
                <enumeratedValue>
                  <name>reset_done</name>
                  <description>Reset complete.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>busy</name>
                  <description>Reset in progress.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RSV_0X02</name>
              <description>Reserved for Future Use</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPIXIP</name>
              <description>SPI XiP Master Reset.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>reset_write</name>
                <usage>write</usage>
                <enumeratedValue>
                  <name>RFU</name>
                  <description>Reserved. Do not use.</description>
                  <isDefault>true</isDefault>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>reset</name>
                  <description>Starts reset operation.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <name>reset_read</name>
                <usage>read</usage>
                <enumeratedValue>
                  <name>reset_done</name>
                  <description>Reset complete.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>busy</name>
                  <description>Reset in progress.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>XSPIM</name>
              <description>GSPI XiP Master Controller Reset.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>reset_write</name>
                <usage>write</usage>
                <enumeratedValue>
                  <name>RFU</name>
                  <description>Reserved. Do not use.</description>
                  <isDefault>true</isDefault>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>reset</name>
                  <description>Starts reset operation.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <name>reset_read</name>
                <usage>read</usage>
                <enumeratedValue>
                  <name>reset_done</name>
                  <description>Reset complete.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>busy</name>
                  <description>Reset in progress.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO3</name>
              <description>GPIO3 Reset.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>reset_write</name>
                <usage>write</usage>
                <enumeratedValue>
                  <name>RFU</name>
                  <description>Reserved. Do not use.</description>
                  <isDefault>true</isDefault>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>reset</name>
                  <description>Starts reset operation.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <name>reset_read</name>
                <usage>read</usage>
                <enumeratedValue>
                  <name>reset_done</name>
                  <description>Reset complete.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>busy</name>
                  <description>Reset in progress.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SDHC</name>
              <description>SDHC/SDIO Reset.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>reset_write</name>
                <usage>write</usage>
                <enumeratedValue>
                  <name>RFU</name>
                  <description>Reserved. Do not use.</description>
                  <isDefault>true</isDefault>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>reset</name>
                  <description>Starts reset operation.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <name>reset_read</name>
                <usage>read</usage>
                <enumeratedValue>
                  <name>reset_done</name>
                  <description>Reset complete.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>busy</name>
                  <description>Reset in progress.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OWIRE</name>
              <description>OWIRE Reset.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>reset_write</name>
                <usage>write</usage>
                <enumeratedValue>
                  <name>RFU</name>
                  <description>Reserved. Do not use.</description>
                  <isDefault>true</isDefault>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>reset</name>
                  <description>Starts reset operation.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <name>reset_read</name>
                <usage>read</usage>
                <enumeratedValue>
                  <name>reset_done</name>
                  <description>Reset complete.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>busy</name>
                  <description>Reset in progress.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WDT1</name>
              <description>WDT1 Reset.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>reset_write</name>
                <usage>write</usage>
                <enumeratedValue>
                  <name>RFU</name>
                  <description>Reserved. Do not use.</description>
                  <isDefault>true</isDefault>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>reset</name>
                  <description>Starts reset operation.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <name>reset_read</name>
                <usage>read</usage>
                <enumeratedValue>
                  <name>reset_done</name>
                  <description>Reset complete.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>busy</name>
                  <description>Reset in progress.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SPI3</name>
              <description>SPI3 Reset.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>reset_write</name>
                <usage>write</usage>
                <enumeratedValue>
                  <name>RFU</name>
                  <description>Reserved. Do not use.</description>
                  <isDefault>true</isDefault>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>reset</name>
                  <description>Starts reset operation.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <name>reset_read</name>
                <usage>read</usage>
                <enumeratedValue>
                  <name>reset_done</name>
                  <description>Reset complete.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>busy</name>
                  <description>Reset in progress.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>I2S</name>
              <description>I2S Reset.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>reset_write</name>
                <usage>write</usage>
                <enumeratedValue>
                  <name>RFU</name>
                  <description>Reserved. Do not use.</description>
                  <isDefault>true</isDefault>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>reset</name>
                  <description>Starts reset operation.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <name>reset_read</name>
                <usage>read</usage>
                <enumeratedValue>
                  <name>reset_done</name>
                  <description>Reset complete.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>busy</name>
                  <description>Reset in progress.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SPIMM0</name>
              <description>SPIMM0 Reset.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>reset_write</name>
                <usage>write</usage>
                <enumeratedValue>
                  <name>RFU</name>
                  <description>Reserved. Do not use.</description>
                  <isDefault>true</isDefault>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>reset</name>
                  <description>Starts reset operation.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <name>reset_read</name>
                <usage>read</usage>
                <enumeratedValue>
                  <name>reset_done</name>
                  <description>Reset complete.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>busy</name>
                  <description>Reset in progress.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SPIMM1</name>
              <description>SPIMM1 Reset.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>reset_write</name>
                <usage>write</usage>
                <enumeratedValue>
                  <name>RFU</name>
                  <description>Reserved. Do not use.</description>
                  <isDefault>true</isDefault>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>reset</name>
                  <description>Starts reset operation.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <name>reset_read</name>
                <usage>read</usage>
                <enumeratedValue>
                  <name>reset_done</name>
                  <description>Reset complete.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>busy</name>
                  <description>Reset in progress.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SPIMM2</name>
              <description>SPIMM2 Reset.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>reset_write</name>
                <usage>write</usage>
                <enumeratedValue>
                  <name>RFU</name>
                  <description>Reserved. Do not use.</description>
                  <isDefault>true</isDefault>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>reset</name>
                  <description>Starts reset operation.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <name>reset_read</name>
                <usage>read</usage>
                <enumeratedValue>
                  <name>reset_done</name>
                  <description>Reset complete.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>busy</name>
                  <description>Reset in progress.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SPIMS0</name>
              <description>SPIMS0 Reset.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>reset_write</name>
                <usage>write</usage>
                <enumeratedValue>
                  <name>RFU</name>
                  <description>Reserved. Do not use.</description>
                  <isDefault>true</isDefault>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>reset</name>
                  <description>Starts reset operation.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <name>reset_read</name>
                <usage>read</usage>
                <enumeratedValue>
                  <name>reset_done</name>
                  <description>Reset complete.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>busy</name>
                  <description>Reset in progress.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SPIXMEM</name>
              <description>SPIXMEM Reset.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>reset_write</name>
                <usage>write</usage>
                <enumeratedValue>
                  <name>RFU</name>
                  <description>Reserved. Do not use.</description>
                  <isDefault>true</isDefault>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>reset</name>
                  <description>Starts reset operation.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <name>reset_read</name>
                <usage>read</usage>
                <enumeratedValue>
                  <name>reset_done</name>
                  <description>Reset complete.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>busy</name>
                  <description>Reset in progress.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SMPHR</name>
              <description>SMPHR Reset.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>reset_write</name>
                <usage>write</usage>
                <enumeratedValue>
                  <name>RFU</name>
                  <description>Reserved. Do not use.</description>
                  <isDefault>true</isDefault>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>reset</name>
                  <description>Starts reset operation.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <name>reset_read</name>
                <usage>read</usage>
                <enumeratedValue>
                  <name>reset_done</name>
                  <description>Reset complete.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>busy</name>
                  <description>Reset in progress.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
