cmsis-svd/cmsis-svd/data/Maxim/max32650.svd
        <register>
          <name>EN1_CLR</name>
          <description>GPIO Alternate Function Clear. Writing a 1 to one or more bits in this register clears the bits in the same positions in GPIO_EN1 to 0, without affecting other bits in that register.</description>
          <addressOffset>0x70</addressOffset>
          <fields>
            <field>
              <name>ALL</name>
              <description>Mask of all of the pins on the port.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EN2</name>
          <description>GPIO Alternate Function Enable Register. Each bit in this register selects between primary/secondary functions for the associated GPIO pin in this port.</description>
          <addressOffset>0x74</addressOffset>
          <fields>
            <field>
              <name>GPIO_EN2</name>
              <description>Mask of all of the pins on the port.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>primary</name>
                  <description>Primary function selected.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>secondary</name>
                  <description>Secondary function selected.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EN2_SET</name>
          <description>GPIO Alternate Function 2 Set. Writing a 1 to one or more bits in this register sets the bits in the same positions in GPIO_EN2 to 1, without affecting other bits in that register.</description>
          <addressOffset>0x78</addressOffset>
          <fields>
            <field>
              <name>ALL</name>
              <description>Mask of all of the pins on the port.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EN2_CLR</name>
          <description>GPIO Wake Alternate Function Clear. Writing a 1 to one or more bits in this register clears the bits in the same positions in GPIO_EN2 to 0, without affecting other bits in that register.</description>
          <addressOffset>0x7C</addressOffset>
          <fields>
            <field>
              <name>ALL</name>
              <description>Mask of all of the pins on the port.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IS</name>
          <description>Input Hysteresis Enable Register</description>
          <addressOffset>0xA8</addressOffset>
        </register>
        <register>
          <name>SR</name>
          <description>Slew Rate Select Register.</description>
          <addressOffset>0xAC</addressOffset>
        </register>
        <register>
          <name>DS</name>
          <description>GPIO Drive Strength Register. Each bit in this register selects the drive strength for the associated GPIO pin in this port. Refer to the Datasheet for sink/source current of GPIO pins in each mode.</description>
          <addressOffset>0xB0</addressOffset>
          <fields>
            <field>
              <name>DS</name>
              <description>Mask of all of the pins on the port.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ld</name>
                  <description>GPIO port pin is in low-drive mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>hd</name>
                  <description>GPIO port pin is in high-drive mode.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DS1</name>
          <description>GPIO Drive Strength 1 Register. Each bit in this register selects the drive strength for the associated GPIO pin in this port. Refer to the Datasheet for sink/source current of GPIO pins in each mode.</description>
          <addressOffset>0xB4</addressOffset>
          <fields>
            <field>
              <name>ALL</name>
              <description>Mask of all of the pins on the port.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PS</name>
          <description>GPIO Pull Select Mode.</description>
          <addressOffset>0xB8</addressOffset>
          <fields>
            <field>
              <name>ALL</name>
              <description>Mask of all of the pins on the port.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>VSSEL</name>
          <description>GPIO Voltage Select.</description>
          <addressOffset>0xC0</addressOffset>
          <fields>
            <field>
              <name>ALL</name>
              <description>Mask of all of the pins on the port.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <!--GPIO0 Individual I/O for each GPIO-->
    <peripheral derivedFrom="GPIO0">
      <name>GPIO1</name>
      <description>Individual I/O for each GPIO 1</description>
      <baseAddress>0x40009000</baseAddress>
      <interrupt>
        <name>GPIO1</name>
        <description>GPIO1 IRQ</description>
        <value>25</value>
      </interrupt>
    </peripheral>
