cmsis-svd/cmsis-svd/data/Maxim/max32650.svd
    <!--GPIO1 Individual I/O for each GPIO 1-->
    <peripheral derivedFrom="GPIO0">
      <name>GPIO2</name>
      <description>Individual I/O for each GPIO 2</description>
      <baseAddress>0x4000A000</baseAddress>
      <interrupt>
        <name>GPIO2</name>
        <description>GPIO2 IRQ</description>
        <value>26</value>
      </interrupt>
    </peripheral>
    <!--GPIO2 Individual I/O for each GPIO 2-->
    <peripheral derivedFrom="GPIO0">
      <name>GPIO3</name>
      <description>Individual I/O for each GPIO 3</description>
      <baseAddress>0x4000B000</baseAddress>
      <interrupt>
        <name>GPIO3</name>
        <description>GPIO3 IRQ</description>
        <value>58</value>
      </interrupt>
    </peripheral>
    <!--GPIO3 Individual I/O for each GPIO 3-->
    <peripheral>
      <name>HPB</name>
      <description>HyperBus.</description>
      <baseAddress>0x40039000</baseAddress>
      <size>32</size>
      <addressBlock>
        <offset>0x00</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>HPB</name>
        <description>HPB Interrupt.</description>
        <value>61</value>
      </interrupt>
      <registers>
        <register>
          <name>STATUS</name>
          <description>Controller Status Register.</description>
          <addressOffset>0x0</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x07010F01</resetMask>
          <fields>
            <field>
              <name>WRSTOERR</name>
              <description>RSTO Error in Write Transaction.</description>
              <bitRange>[26:26]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>WDECERR</name>
              <description>Decode Error in Write Transaction.</description>
              <bitRange>[24:24]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>WACT</name>
              <description>Write Transaction Active.</description>
              <bitRange>[16:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RDSSTALL</name>
              <description>RDS Stall Error in Read Transaction.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RRSTOERR</name>
              <description>RSTO Error in Read Transaction.</description>
              <bitRange>[10:10]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RDECERR</name>
              <description>Decode Error in Read Transaction.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RACT</name>
              <description>Read Transaction Active.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTEN</name>
          <description>Interrupt Enable Control Register.</description>
          <addressOffset>0x4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x80000001</resetMask>
          <fields>
            <field>
              <name>ERRINTE</name>
              <description>Error Interrupt Enable.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTFL</name>
          <description>Interrupt Status Register.</description>
          <addressOffset>0x8</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>
          <fields>
            <field>
              <name>ERRINTE</name>
              <description>Error Interrupt Status.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>4</dimIncrement>
          <name>MBR[%s]</name>
          <description>Memory Base Address Registers.</description>
          <addressOffset>0x10</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFF000000</resetMask>
          <fields>
            <field>
              <name>ADDR</name>
              <description>Base address for memory space 0.</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>4</dimIncrement>
          <name>MCR[%s]</name>
          <description>Memory Configuration Registers.</description>
          <addressOffset>0x20</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000003</resetValue>
          <resetMask>0x00030033</resetMask>
          <fields>
            <field>
              <name>MAXEN</name>
              <description>Maximum length Enable.</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MAXLEN</name>
              <description>Maximum Length.</description>
              <bitRange>[26:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HSE</name>
              <description>Halt Sleep Exit.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FRL</name>
              <description>Fixed Read latency enable.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CRT</name>
              <description>Configuration Register Target.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DEVTYPE</name>
              <description>Device Type.</description>
              <bitRange>[4:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HYPER_FLASH</name>
                  <description>Hyper flash device.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XCCELA_PSRAM</name>
                  <description>Hyper PSRAM device.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HYPER_RAM</name>
                  <description>Hyper RAM device.</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>4</dimIncrement>
          <name>MTR[%s]</name>
          <description>Memory Timing Registers.</description>
          <addressOffset>0x30</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFF0F</resetMask>
          <fields>
            <field>
              <name>RCSHI</name>
              <description>Read Chip Select High Between Operations.</description>
              <bitRange>[31:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WCSHI</name>
              <description>Write Chip Select High Between Operations.</description>
              <bitRange>[27:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RCSS</name>
              <description>Read Chip Select Setup To Next CK Rising Edge.</description>
              <bitRange>[23:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WCSS</name>
              <description>Write Chip Select Setup To Next CK Rising Edge.</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RCSH</name>
              <description>Read Chip Select Hold After CK falling Edge.</description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WCSH</name>
              <description>Write Chip Select Hold After CK falling Edge.</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LTCY</name>
              <description>Latency Cycle for HyperRAM mode.</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>5CLOCK</name>
                  <description>5 clock latency.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6CLOCK</name>
                  <description>6 clock latency.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3CLOCK</name>
                  <description>3 clock latency.</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4CLOCK</name>
                  <description>4 clock latency.</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
