cmsis-svd/cmsis-svd/data/Maxim/max32650.svd
        <register>
          <name>INT_FL0</name>
          <description>Interrupt Status Register.</description>
          <addressOffset>0x08</addressOffset>
          <fields>
            <field>
              <name>DONE</name>
              <description>Transfer Done Interrupt.</description>
              <bitRange>[0:0]</bitRange>
              <enumeratedValues>
                <name>INT_FL0_Done</name>
                <enumeratedValue>
                  <name>inactive</name>
                  <description>No Interrupt is Pending.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pending</name>
                  <description>An interrupt is pending.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RX_MODE</name>
              <description>Interactive Receive Interrupt.</description>
              <bitRange>[1:1]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>inactive</name>
                  <description>No Interrupt is Pending.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pending</name>
                  <description>An interrupt is pending.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GEN_CALL_ADDR</name>
              <description>Slave General Call Address Match Interrupt.</description>
              <bitRange>[2:2]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>inactive</name>
                  <description>No Interrupt is Pending.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pending</name>
                  <description>An interrupt is pending.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADDR_MATCH</name>
              <description>Slave Address Match Interrupt.</description>
              <bitRange>[3:3]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>inactive</name>
                  <description>No Interrupt is Pending.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pending</name>
                  <description>An interrupt is pending.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RX_THRESH</name>
              <description>Receive Threshold Interrupt. This bit is automaticcaly cleared when RX_FIFO is below the threshold level.</description>
              <bitRange>[4:4]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>inactive</name>
                  <description>No interrupt is pending.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pending</name>
                  <description>An interrupt is pending. RX_FIFO equal or more bytes than the threshold.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TX_THRESH</name>
              <description>Transmit Threshold Interrupt. This bit is automaticcaly cleared when TX_FIFO is above the threshold level.</description>
              <bitRange>[5:5]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>inactive</name>
                  <description>No interrupt is pending.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pending</name>
                  <description>An interrupt is pending. TX_FIFO has equal or less bytes than the threshold.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STOP</name>
              <description>STOP Interrupt.</description>
              <bitRange>[6:6]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>inactive</name>
                  <description>No interrupt is pending.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pending</name>
                  <description>An interrupt is pending. TX_FIFO has equal or less bytes than the threshold.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADDR_ACK</name>
              <description>Address Acknowledge Interrupt.</description>
              <bitRange>[7:7]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>inactive</name>
                  <description>No Interrupt is Pending.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pending</name>
                  <description>An interrupt is pending.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ARB_ER</name>
              <description>Arbritation error Interrupt.</description>
              <bitRange>[8:8]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>inactive</name>
                  <description>No Interrupt is Pending.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pending</name>
                  <description>An interrupt is pending.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TO_ER</name>
              <description>timeout Error Interrupt.</description>
              <bitRange>[9:9]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>inactive</name>
                  <description>No Interrupt is Pending.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pending</name>
                  <description>An interrupt is pending.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADDR_NACK_ER</name>
              <description>Address NACK Error Interrupt.</description>
              <bitRange>[10:10]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>inactive</name>
                  <description>No Interrupt is Pending.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pending</name>
                  <description>An interrupt is pending.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DATA_ER</name>
              <description>Data NACK Error Interrupt.</description>
              <bitRange>[11:11]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>inactive</name>
                  <description>No Interrupt is Pending.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pending</name>
                  <description>An interrupt is pending.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DO_NOT_RESP_ER</name>
              <description>Do Not Respond Error Interrupt.</description>
              <bitRange>[12:12]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>inactive</name>
                  <description>No Interrupt is Pending.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pending</name>
                  <description>An interrupt is pending.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>START_ER</name>
              <description>Start Error Interrupt.</description>
              <bitRange>[13:13]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>inactive</name>
                  <description>No Interrupt is Pending.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pending</name>
                  <description>An interrupt is pending.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STOP_ER</name>
              <description>Stop Error Interrupt.</description>
              <bitRange>[14:14]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>inactive</name>
                  <description>No Interrupt is Pending.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pending</name>
                  <description>An interrupt is pending.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TX_LOCK_OUT</name>
              <description>Transmit Lock Out Interrupt.</description>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_EN0</name>
          <description>Interrupt Enable Register.</description>
          <addressOffset>0x0C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>DONE</name>
              <description>Transfer Done Interrupt Enable.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dis</name>
                  <description>Interrupt disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>en</name>
                  <description>Interrupt enabled when DONE = 1.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RX_MODE</name>
              <description>Description not available.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dis</name>
                  <description>Interrupt disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>en</name>
                  <description>Interrupt enabled when RX_MODE = 1.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GEN_CTRL_ADDR</name>
              <description>Slave mode general call address match received input enable.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dis</name>
                  <description>Interrupt disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>en</name>
                  <description>Interrupt enabled when GEN_CTRL_ADDR = 1.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADDR_MATCH</name>
              <description>Slave mode incoming address match interrupt.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dis</name>
                  <description>Interrupt disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>en</name>
                  <description>Interrupt enabled when ADDR_MATCH = 1.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RX_THRESH</name>
              <description>RX FIFO Above Treshold Level Interrupt Enable.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dis</name>
                  <description>Interrupt disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>en</name>
                  <description>Interrupt enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TX_THRESH</name>
              <description>TX FIFO Below Treshold Level Interrupt Enable.</description>
              <bitRange>[5:5]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dis</name>
                  <description>Interrupt disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>en</name>
                  <description>Interrupt enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STOP</name>
              <description>Stop Interrupt Enable</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dis</name>
                  <description>Interrupt disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>en</name>
                  <description>Interrupt enabled when STOP = 1.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADDR_ACK</name>
              <description>Received Address ACK from Slave Interrupt.</description>
              <bitRange>[7:7]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dis</name>
                  <description>Interrupt disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>en</name>
                  <description>Interrupt enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ARB_ER</name>
              <description>Master Mode Arbitration Lost Interrupt.</description>
              <bitRange>[8:8]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dis</name>
                  <description>Interrupt disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>en</name>
                  <description>Interrupt enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TO_ER</name>
              <description>Timeout Error Interrupt Enable.</description>
              <bitRange>[9:9]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dis</name>
                  <description>Interrupt disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>en</name>
                  <description>Interrupt enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADDR_ER</name>
              <description>Master Mode Address NACK Received Interrupt.</description>
              <bitRange>[10:10]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dis</name>
                  <description>Interrupt disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>en</name>
                  <description>Interrupt enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DATA_ER</name>
              <description>Master Mode Data NACK Received Interrupt.</description>
              <bitRange>[11:11]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dis</name>
                  <description>Interrupt disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>en</name>
                  <description>Interrupt enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DO_NOT_RESP_ER</name>
              <description>Slave Mode Do Not Respond Interrupt.</description>
              <bitRange>[12:12]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dis</name>
                  <description>Interrupt disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>en</name>
                  <description>Interrupt enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>START_ER</name>
              <description>Out of Sequence START condition detected interrupt.</description>
              <bitRange>[13:13]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dis</name>
                  <description>Interrupt disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>en</name>
                  <description>Interrupt enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STOP_ER</name>
              <description>Out of Sequence STOP condition detected interrupt.</description>
              <bitRange>[14:14]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dis</name>
                  <description>Interrupt disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>en</name>
                  <description>Interrupt enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TX_LOCK_OUT</name>
              <description>TX FIFO Locked Out Interrupt.</description>
              <bitRange>[15:15]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dis</name>
                  <description>Interrupt disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>en</name>
                  <description>Interrupt enabled when TXLOIE = 1.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
