cmsis-svd/cmsis-svd/data/Maxim/max32650.svd
      </registers>
    </peripheral>
    <!--I2C0 Inter-Integrated Circuit.-->
    <peripheral derivedFrom="I2C0">
      <name>I2C1</name>
      <description>Inter-Integrated Circuit. 1</description>
      <baseAddress>0x4001E000</baseAddress>
      <interrupt>
        <name>I2C1</name>
        <description>I2C1 IRQ</description>
        <value>36</value>
      </interrupt>
    </peripheral>
    <!--I2C1 Inter-Integrated Circuit. 1-->
    <peripheral>
      <name>ICC0</name>
      <description>Instruction Cache Controller Registers</description>
      <baseAddress>0x4002A000</baseAddress>
      <addressBlock>
        <offset>0x00</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CACHE_ID</name>
          <description>Cache ID Register.</description>
          <addressOffset>0x0000</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>RELNUM</name>
              <description>Release Number. Identifies the RTL release version.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>PARTNUM</name>
              <description>Part Number. This field reflects the value of C_ID_PART_NUMBER configuration parameter.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>CCHID</name>
              <description>Cache ID. This field reflects the value of the C_ID_CACHEID configuration parameter.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MEMCFG</name>
          <description>Memory Configuration Register.</description>
          <addressOffset>0x0004</addressOffset>
          <access>read-only</access>
          <resetValue>0x00080008</resetValue>
          <fields>
            <field>
              <name>CCHSZ</name>
              <description>Cache Size. Indicates total size in Kbytes of cache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>MEMSZ</name>
              <description>Main Memory Size. Indicates the total size, in units of 128 Kbytes, of code memory accessible to the cache controller.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CACHE_CTRL</name>
          <description>Cache Control and Status Register.</description>
          <addressOffset>0x0100</addressOffset>
          <fields>
            <field>
              <name>CACHE_EN</name>
              <description>Cache Enable. Controls whether the cache is bypassed or is in use. Changing the state of this bit will cause the instruction cache to be flushed and its contents invalidated.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dis</name>
                  <description>Cache Bypassed. Instruction data is stored in the line fill buffer but is not written to main cache memory array.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>en</name>
                  <description>Cache Enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CACHE_RDY</name>
              <description>Cache Ready flag. Cleared by hardware when at any time the cache as a whole is invalidated (including a system reset). When this bit is 0, the cache is effectively in bypass mode (instruction fetches will come from main memory or from the line fill buffer). Set by hardware when the invalidate operation is complete and the cache is ready.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>notReady</name>
                  <description>Not Ready.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ready</name>
                  <description>Ready.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INVALIDATE</name>
          <description>Invalidate All Registers.</description>
          <addressOffset>0x0700</addressOffset>
          <access>read-write</access>
        </register>
      </registers>
    </peripheral>
    <!--ICC0 Instruction Cache Controller Registers-->
    <peripheral derivedFrom="ICC0">
      <name>ICC1</name>
      <description>Instruction Cache Controller Registers 1</description>
      <baseAddress>0x4002F000</baseAddress>
    </peripheral>
    <!--ICC1 Instruction Cache Controller Registers 1-->
    <peripheral>
      <name>NBBFC</name>
      <description>Non Battery-Backed Function Control.</description>
      <baseAddress>0x40000800</baseAddress>
      <addressBlock>
        <offset>0x00</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>REG0</name>
          <description>Register 0.</description>
          <addressOffset>0x00</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>USBRCKSEL</name>
              <description>USB External Core Clock Select.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>sys</name>
                  <description>Generated clock from system clock.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dig</name>
                  <description>Digital clock from a GPIO.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>I2C0DGEN0</name>
              <description>I2C0 SDA Pad Deglitcher enable.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dis</name>
                  <description>Deglitcher disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>en</name>
                  <description>Deglitcher enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>I2C0DGEN1</name>
              <description>I2C0 SCL Pad Deglitcher enable.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dis</name>
                  <description>Deglitcher disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>en</name>
                  <description>Deglitcher enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>I2C1DGEN0</name>
              <description>I2C1 SDA Pad Deglitcher enable.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dis</name>
                  <description>Deglitcher disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>en</name>
                  <description>Deglitcher enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>I2C1DGEN1</name>
              <description>I2C1 SCL Pad Deglitcher enable.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dis</name>
                  <description>Deglitcher disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>en</name>
                  <description>Deglitcher enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>REG1</name>
          <description>Register 1.</description>
          <addressOffset>0x04</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>ACEN</name>
              <description>Auto-calibration Enable.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dis</name>
                  <description>Disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>en</name>
                  <description>Enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACRUN</name>
              <description>Autocalibration Run.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>not</name>
                  <description>Not Running.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>run</name>
                  <description>Running.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LDTRM</name>
              <description>Load Trim.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GAININV</name>
              <description>Invert Gain.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>not</name>
                  <description>Not Running.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>run</name>
                  <description>Running.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ATOMIC</name>
              <description>Atomic mode.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>not</name>
                  <description>Not Running.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>run</name>
                  <description>Running.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MU</name>
              <description>MU value.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>REG2</name>
          <description>Register 2.</description>
          <addressOffset>0x08</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>INITTRM</name>
              <description>Initial Trim Setting.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
            <field>
              <name>MINTRM</name>
              <description>Minimum Trim Setting.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
            <field>
              <name>MAXTRM</name>
              <description>Maximum Trim Setting.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>REG3</name>
          <description>Register 3.</description>
          <addressOffset>0x0C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>DONECNT</name>
              <description>Auto-callibration Done Counter Setting.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
