cmsis-svd/cmsis-svd/data/Maxim/max32650.svd
      </registers>
    </peripheral>
    <!--NBBFC Non Battery-Backed Function Control.-->
    <peripheral>
      <name>OTP</name>
      <description>One Time Programmable Memory controller.</description>
      <baseAddress>0x40041000</baseAddress>
      <addressBlock>
        <offset>0x00</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>OCNTL</name>
          <description>OTP Control Register.</description>
          <addressOffset>0x00</addressOffset>
          <fields>
            <field>
              <name>PA</name>
              <description>This value is the address of the OTP 32-bit value.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>RD_OP</name>
              <description>Setting this bit to a 1 initiates a read of the OTP location specified in the PA field.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>no_operation</name>
                  <description>No Operation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>initiate_read_op</name>
                  <description>Initiate Read Operation.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PROG_OP</name>
              <description>Setting this bit to a 1 initiates a write of the OTP location specified in the PA field.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>no_operation</name>
                  <description>No Operation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>initiate_write_op</name>
                  <description>Initiate Write Operation.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CKDIV</name>
          <description>Clock Divider Register.</description>
          <addressOffset>0x04</addressOffset>
          <resetValue>0x00000064</resetValue>
          <fields>
            <field>
              <name>CKDIV</name>
              <description>The input clock(APB) is divided by this value.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>div_by_2</name>
                  <description>Divide by 2.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>div_by_4</name>
                  <description>Divide by 4.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>div_by_8</name>
                  <description>Divide by 8.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>div_by_16</name>
                  <description>Divide by 16.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>OTPRDATA</name>
          <description>Read Data Register.</description>
          <addressOffset>0x08</addressOffset>
          <fields>
            <field>
              <name>RDATA</name>
              <description>OTP Data Output from read operation.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STAT</name>
          <description>OTP Status Register.</description>
          <addressOffset>0x0C</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>BUSY</name>
              <description>This flag indicates whether the OTP controller is currently performing a read or write operation.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>not_busy</name>
                  <description>OTP controller ready for new operation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>busy</name>
                  <description>OTP controller busy either programming or reading.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FAIL</name>
              <description>Description not available.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nfail</name>
                  <description>No failure.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>fail</name>
                  <description>Failure occurs.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ODATA</name>
          <description>Write Data Register.</description>
          <addressOffset>0x30</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>OTPDATA</name>
              <description>OTP write data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ACNTL</name>
          <description>Access Control Register.</description>
          <addressOffset>0x40</addressOffset>
          <fields>
            <field>
              <name>ADATA</name>
              <description>System Info Block Access Data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
