cmsis-svd/cmsis-svd/data/Maxim/max32650.svd
      </registers>
    </peripheral>
    <!--PT Pulse Train-->
    <peripheral derivedFrom="PT">
      <name>PT1</name>
      <description>Pulse Train 1</description>
      <baseAddress>0x4003C040</baseAddress>
    </peripheral>
    <!--PT1 Pulse Train 1-->
    <peripheral derivedFrom="PT">
      <name>PT2</name>
      <description>Pulse Train 2</description>
      <baseAddress>0x4003C060</baseAddress>
    </peripheral>
    <!--PT2 Pulse Train 2-->
    <peripheral derivedFrom="PT">
      <name>PT3</name>
      <description>Pulse Train 3</description>
      <baseAddress>0x4003C080</baseAddress>
    </peripheral>
    <!--PT3 Pulse Train 3-->
    <peripheral derivedFrom="PT">
      <name>PT4</name>
      <description>Pulse Train 4</description>
      <baseAddress>0x4003C0A0</baseAddress>
    </peripheral>
    <!--PT4 Pulse Train 4-->
    <peripheral derivedFrom="PT">
      <name>PT5</name>
      <description>Pulse Train 5</description>
      <baseAddress>0x4003C0C0</baseAddress>
    </peripheral>
    <!--PT5 Pulse Train 5-->
    <peripheral derivedFrom="PT">
      <name>PT6</name>
      <description>Pulse Train 6</description>
      <baseAddress>0x4003C0E0</baseAddress>
    </peripheral>
    <!--PT6 Pulse Train 6-->
    <peripheral derivedFrom="PT">
      <name>PT7</name>
      <description>Pulse Train 7</description>
      <baseAddress>0x4003C100</baseAddress>
    </peripheral>
    <!--PT7 Pulse Train 7-->
    <peripheral derivedFrom="PT">
      <name>PT8</name>
      <description>Pulse Train 8</description>
      <baseAddress>0x4003C120</baseAddress>
    </peripheral>
    <!--PT8 Pulse Train 8-->
    <peripheral derivedFrom="PT">
      <name>PT9</name>
      <description>Pulse Train 9</description>
      <baseAddress>0x4003C140</baseAddress>
    </peripheral>
    <!--PT9 Pulse Train 9-->
    <peripheral derivedFrom="PT">
      <name>PT10</name>
      <description>Pulse Train 10</description>
      <baseAddress>0x4003C160</baseAddress>
    </peripheral>
    <!--PT10 Pulse Train 10-->
    <peripheral derivedFrom="PT">
      <name>PT11</name>
      <description>Pulse Train 11</description>
      <baseAddress>0x4003C180</baseAddress>
    </peripheral>
    <!--PT11 Pulse Train 11-->
    <peripheral derivedFrom="PT">
      <name>PT12</name>
      <description>Pulse Train 12</description>
      <baseAddress>0x4003C1A0</baseAddress>
    </peripheral>
    <!--PT12 Pulse Train 12-->
    <peripheral derivedFrom="PT">
      <name>PT13</name>
      <description>Pulse Train 13</description>
      <baseAddress>0x4003C1C0</baseAddress>
    </peripheral>
    <!--PT13 Pulse Train 13-->
    <peripheral derivedFrom="PT">
      <name>PT14</name>
      <description>Pulse Train 14</description>
      <baseAddress>0x4003C1E0</baseAddress>
    </peripheral>
    <!--PT14 Pulse Train 14-->
    <peripheral derivedFrom="PT">
      <name>PT15</name>
      <description>Pulse Train 15</description>
      <baseAddress>0x4003C200</baseAddress>
    </peripheral>
    <!--PT15 Pulse Train 15-->
    <peripheral>
      <name>PWRSEQ</name>
      <description>Power Sequencer / Low Power Control Register.</description>
      <baseAddress>0x40006800</baseAddress>
      <addressBlock>
        <offset>0x00</offset>
        <size>0x800</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>LPCN</name>
          <description>Low Power Control Register.</description>
          <addressOffset>0x00</addressOffset>
          <fields>
            <field>
              <name>RAMRET</name>
              <description>System RAM retention in BACKUP mode. These two bits are used in conjuction with RREGEN bit.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dis</name>
                  <description>Disable Ram Retention.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>en1</name>
                  <description>Enable System RAM 0 retention.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>en2</name>
                  <description>Enable System RAM 0 and 1 retention.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>en3</name>
                  <description>Enable System RAM 0 and 1 retention, if RREGEN=0, Enable all System RAM retention.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OVR</name>
              <description>Operating Voltage Range</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0_9V</name>
                  <description>0.9V 24MHz</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1_0V</name>
                  <description>1.0V 48MHz</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1_1V</name>
                  <description>1.1V 96MHz</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BLKDET</name>
              <description>Block Auto-Detect</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>enabled</name>
                  <description>enable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>disable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FVDDEN</name>
              <description>Flash VDD Enabled</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RREGEN</name>
              <description>Retention Regulator Enable. This bit controls the retention regulator in BACKUP mode.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dis</name>
                  <description>Disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>en</name>
                  <description>Enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BCKGRND</name>
              <description>Background Mode ENable. This bit allows low-power background mode operations, while the CPU is in DeepSleep.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dis</name>
                  <description>Disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>en</name>
                  <description>Enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FWKM</name>
              <description>Fast Wake-Up Mode. This bit enables fast wake-up from DeepSleep mode. (5uS typical).</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dis</name>
                  <description>Disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>en</name>
                  <description>Enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BGOFF</name>
              <description>Bandgap OFF. This controls the System Bandgap in DeepSleep mode.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>on</name>
                  <description>Bandgap is always ON.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>off</name>
                  <description>Bandgap is OFF in DeepSleep mode(default).</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PORVDDCMD</name>
              <description>VDDC(VCore) Power-On Reset Monitor Disable. This bit controls the Power-On Reset monitor on VDDC supply in DeepSleep and BACKUP mode.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dis</name>
                  <description>Disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>en</name>
                  <description>Enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VDDCMD</name>
              <description>VDDC(Vcore) Monitor Disable. This bit controls the power monitor on the VCore supply in all operating modes.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>en</name>
                  <description>Enable if Bandgap is ON(default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dis</name>
                  <description>Disabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VRTCMD</name>
              <description>VRTC Monitor Disable. This bit controls the power monitor on the Always-On Supply in all operating modes.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>en</name>
                  <description>Enable if Bandgap is ON(default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dis</name>
                  <description>Disabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VDDAMD</name>
              <description>VDDA Monitor Disable. This bit controls the power monitor of the Analog Supply in all operating modes.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>en</name>
                  <description>Enable if Bandgap is ON(default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dis</name>
                  <description>Disabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VDDIOMD</name>
              <description>VDDIO Monitor Disable. This bit controls the power monitor of the Analog Supply in all operating modes.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>en</name>
                  <description>Enable if Bandgap is ON(default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dis</name>
                  <description>Disabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VDDIOHMD</name>
              <description>VFDDIOH Monitor Disable. This bit controls the power monitor of the Analog Supply in all operating modes.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>en</name>
                  <description>Enable if Bandgap is ON(default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dis</name>
                  <description>Disabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PORVDDIOMD</name>
              <description>VDDIO Power-On Reset Monitor Disable. This bit controls the Power-On Reset monitor on VDDIO supply in all operating mods.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dis</name>
                  <description>Disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>en</name>
                  <description>Enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PORVDDIOHMD</name>
              <description>VDDIOH Power-On Reset Monitor Disable. This bit controls the Power-On Reset monitor on VDDIOH supply in all operating mods.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dis</name>
                  <description>Disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>en</name>
                  <description>Enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VDDBMD</name>
              <description>VDDB Power-On Reset Monitor Disable. This bit controls the Power-On Reset monitor on VDDB supply in all operating mods.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dis</name>
                  <description>Disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>en</name>
                  <description>Enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LPWKST0</name>
          <description>Low Power I/O Wakeup Status Register 0. This register indicates the low power wakeup status for GPIO0.</description>
          <addressOffset>0x04</addressOffset>
          <fields>
            <field>
              <name>WAKEST</name>
              <description>Wakeup IRQ flags (write ones to clear). One or more of these bits will be set when the corresponding dedicated GPIO pin(s) transition(s) from low to high or high to low. If GPIO wakeup source is selected, using PM.GPIOWKEN register, and the corresponding bit is also selected in LPWKEN register, an interrupt will be gnerated to wake up the CPU from a low power mode.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LPWKEN0</name>
          <description>Low Power I/O Wakeup Enable Register 0. This register enables low power wakeup functionality for GPIO0.</description>
          <addressOffset>0x08</addressOffset>
          <fields>
            <field>
              <name>WAKEEN</name>
              <description>Enable wakeup. These bits allow wakeup from the corresponding GPIO pin(s) on transition(s) from low to high or high to low when PM.GPIOWKEN is set. Wakeup status is indicated in PPWKST register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>31</bitWidth>
            </field>
          </fields>
        </register>
