cmsis-svd/cmsis-svd/data/Maxim/max32650.svd
        <register derivedFrom="LPWKST0">
          <name>LPWKST1</name>
          <description>Low Power I/O Wakeup Status Register 1. This register indicates the low power wakeup status for GPIO1.</description>
          <addressOffset>0x0C</addressOffset>
        </register>
        <register derivedFrom="LPWKEN0">
          <name>LPWKEN1</name>
          <description>Low Power I/O Wakeup Enable Register 1. This register enables low power wakeup functionality for GPIO1.</description>
          <addressOffset>0x10</addressOffset>
        </register>
        <register derivedFrom="LPWKST0">
          <name>LPWKST2</name>
          <description>Low Power I/O Wakeup Status Register 2. This register indicates the low power wakeup status for GPIO2.</description>
          <addressOffset>0x14</addressOffset>
        </register>
        <register derivedFrom="LPWKEN0">
          <name>LPWKEN2</name>
          <description>Low Power I/O Wakeup Enable Register 2. This register enables low power wakeup functionality for GPIO2.</description>
          <addressOffset>0x18</addressOffset>
        </register>
        <register derivedFrom="LPWKST0">
          <name>LPWKST3</name>
          <description>Low Power I/O Wakeup Status Register 3. This register indicates the low power wakeup status for GPIO3.</description>
          <addressOffset>0x1C</addressOffset>
        </register>
        <register derivedFrom="LPWKEN0">
          <name>LPWKEN3</name>
          <description>Low Power I/O Wakeup Enable Register 3. This register enables low power wakeup functionality for GPIO3.</description>
          <addressOffset>0x20</addressOffset>
        </register>
        <register>
          <name>LPPWST</name>
          <description>Low Power Peripheral Wakeup Status Register.</description>
          <addressOffset>0x30</addressOffset>
          <fields>
            <field>
              <name>USBLSWKST</name>
              <description>USB UTMI Linestate Detect Wakeup Flag(write one to clear). One or both of these bits will be set when the USB bus activity causes the linestate to change and the device to wake while USB wakeup is enabled using PMLUSBWKEN.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>USBVBUSWKST</name>
              <description>USB VBUS Detect Wakeup Flag (write one to clear). This bit will be set when the USB power supply is powered on or powered off.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDMAWKST</name>
              <description>Smart DMA Detect Wakeup Flag (write one to clear). This bit will be set when the SDMA IRQ transition from low to high or on high to low.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BBMODEST</name>
              <description>Battery Back Wakeup Flag (write one to clear). This bit will be set when exiting Battery Backup Mode.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LPPWEN</name>
          <description>Low Power Peripheral Wakeup Enable Register.</description>
          <addressOffset>0x34</addressOffset>
          <fields>
            <field>
              <name>USBLSWKEN</name>
              <description>USB UTMI Linestate Detect Wakeup Enable. These bits allow wakeup from the corresponding USB linestate signal(s) on transition(s) from low to high or high to low when PM.USBWKEN is set.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>USBVBUSWKEN</name>
              <description>USB VBUS Detect Wakeup Enable. This bit allows wakeup from the USB power supply on or off status.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDMAWKEN</name>
              <description>Smart DMA Wakeup Enable. This bit allows wakeup from the Smart DMA IRQ.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LPMEMSD</name>
          <description>Low Power Memory Shutdown Control.</description>
          <addressOffset>0x40</addressOffset>
          <fields>
            <field>
              <name>SRAM0SD</name>
              <description>System RAM block 0 Shut Down.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>normal</name>
                  <description>Normal Operating Mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>shutdown</name>
                  <description>Shutdown Mode.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM1SD</name>
              <description>System RAM block 1 Shut Down.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>normal</name>
                  <description>Normal Operating Mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>shutdown</name>
                  <description>Shutdown Mode.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM2SD</name>
              <description>System RAM block 2 Shut Down.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>normal</name>
                  <description>Normal Operating Mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>shutdown</name>
                  <description>Shutdown Mode.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM3SD</name>
              <description>System RAM block 3 Shut Down.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>normal</name>
                  <description>Normal Operating Mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>shutdown</name>
                  <description>Shutdown Mode.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM4SD</name>
              <description>System RAM block 4 Shut Down.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>normal</name>
                  <description>Normal Operating Mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>shutdown</name>
                  <description>Shutdown Mode.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM5SD</name>
              <description>System RAM block 5 Shut Down.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>normal</name>
                  <description>Normal Operating Mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>shutdown</name>
                  <description>Shutdown Mode.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM6SD</name>
              <description>System RAM block 6 Shut Down.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>normal</name>
                  <description>Normal Operating Mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>shutdown</name>
                  <description>Shutdown Mode.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ICACHESD</name>
              <description>Instruction Cache RAM Shut Down.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>normal</name>
                  <description>Normal Operating Mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>shutdown</name>
                  <description>Shutdown Mode.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ICACHEXIPSD</name>
              <description>XiP Instruction Cache RAM Shut Down.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>normal</name>
                  <description>Normal Operating Mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>shutdown</name>
                  <description>Shutdown Mode.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SCACHESD</name>
              <description>System Cache RAM Shut Down.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>normal</name>
                  <description>Normal Operating Mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>shutdown</name>
                  <description>Shutdown Mode.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CRYPTOSD</name>
              <description>Crypto MAA RAM Shut Down.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>normal</name>
                  <description>Normal Operating Mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>shutdown</name>
                  <description>Shutdown Mode.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USBFIFOSD</name>
              <description>USB FIFO Shut Down.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>normal</name>
                  <description>Normal Operating Mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>shutdown</name>
                  <description>Shutdown Mode.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ROMSD</name>
              <description>ROM Shut Down.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>normal</name>
                  <description>Normal Operating Mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>shutdown</name>
                  <description>Shutdown Mode.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ROM1SD</name>
              <description>ROM1 Shut Down.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>normal</name>
                  <description>Normal Operating Mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>shutdown</name>
                  <description>Shutdown Mode.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IC1SD</name>
              <description>ICache 1 Shut Down.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>normal</name>
                  <description>Normal Operating Mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>shutdown</name>
                  <description>Shutdown Mode.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>BB_GP0</name>
          <description>Battery Backed General Purpose Register 0</description>
          <addressOffset>0x48</addressOffset>
        </register>
        <register>
          <name>BB_GP1</name>
          <description>Battery Backed General Purpose Register 1</description>
          <addressOffset>0x4C</addressOffset>
        </register>
        <register>
          <name>LPMCSTAT</name>
          <description>Low Power Multi-Core Status</description>
          <addressOffset>0x50</addressOffset>
        </register>
        <register>
          <name>LPMCREQ</name>
          <description>Low Power Multi-Core Request</description>
          <addressOffset>0x54</addressOffset>
        </register>
