cmsis-svd/cmsis-svd/data/Maxim/max32650.svd
      </registers>
    </peripheral>
    <!--PWRSEQ Power Sequencer / Low Power Control Register.-->
    <peripheral>
      <name>RTC</name>
      <description>Real Time Clock and Alarm.</description>
      <baseAddress>0x40006000</baseAddress>
      <addressBlock>
        <offset>0x00</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>RTC</name>
        <description>RTC interrupt.</description>
        <value>3</value>
      </interrupt>
      <registers>
        <register>
          <name>SEC</name>
          <description>RTC Second Counter. This register contains the 32-bit second counter.</description>
          <addressOffset>0x00</addressOffset>
          <resetMask>0x00000000</resetMask>
        </register>
        <register>
          <name>SSEC</name>
          <description>RTC Sub-second Counter. This counter increments at 256Hz. RTC_SEC is incremented when this register rolls over from 0xFF to 0x00.</description>
          <addressOffset>0x04</addressOffset>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>RTSS</name>
              <description>RTC Sub-second Counter.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RAS</name>
          <description>Time-of-day Alarm.</description>
          <addressOffset>0x08</addressOffset>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>RAS</name>
              <description>Time-of-day Alarm.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>20</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RSSA</name>
          <description>RTC sub-second alarm. This register contains the reload value for the sub-second alarm.</description>
          <addressOffset>0x0C</addressOffset>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>RSSA</name>
              <description>This register contains the reload value for the sub-second alarm.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRL</name>
          <description>RTC Control Register.</description>
          <addressOffset>0x10</addressOffset>
          <resetValue>0x00000008</resetValue>
          <resetMask>0xFFFFFF38</resetMask>
          <fields>
            <field>
              <name>RTCE</name>
              <description>Real Time Clock Enable. This bit enables the Real Time Clock. This bit can only be written when WE=1 and BUSY =0. Change to this bit is effective only after BUSY is cleared from 1 to 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dis</name>
                  <description>Disable.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>en</name>
                  <description>Enable.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADE</name>
              <description>Alarm Time-of-Day Interrupt Enable. Change to this bit is effective only after BUSY is cleared from 1 to 0.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dis</name>
                  <description>Disable.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>en</name>
                  <description>Enable.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ASE</name>
              <description>Alarm Sub-second Interrupt Enable. Change to this bit is effective only after BUSY is cleared from 1 to 0.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dis</name>
                  <description>Disable.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>en</name>
                  <description>Enable.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BUSY</name>
              <description>RTC Busy. This bit is set to 1 by hardware when changes to RTC registers required a synchronized version of the register to be in place. This bit is automatically cleared by hardware.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>idle</name>
                  <description>Idle.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>busy</name>
                  <description>Busy.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RDY</name>
              <description>RTC Ready. This bit is set to 1 by hardware when the RTC count registers update. It can be cleared to 0 by software at any time. It will also be cleared to 0 by hardware just prior to an update of the RTC count register.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>busy</name>
                  <description>Register has not updated.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ready</name>
                  <description>Ready.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RDYE</name>
              <description>RTC Ready Interrupt Enable.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dis</name>
                  <description>Disable.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>en</name>
                  <description>Enable.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ALDF</name>
              <description>Time-of-Day Alarm Interrupt Flag. This alarm is qualified as wake-up source to the processor.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>inactive</name>
                  <description>Not active</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pending</name>
                  <description>Active</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ALSF</name>
              <description>Sub-second Alarm Interrupt Flag. This alarm is qualified as wake-up source to the processor.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>inactive</name>
                  <description>Not active</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pending</name>
                  <description>Active</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SQE</name>
              <description>Square Wave Output Enable.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>inactive</name>
                  <description>Not active</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pending</name>
                  <description>Active</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FT</name>
              <description>Frequency Output Selection. When SQE=1, these bits specify the output frequency on the SQW pin.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>freq1Hz</name>
                  <description>1 Hz (Compensated).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>freq512Hz</name>
                  <description>512 Hz (Compensated).</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>freq4KHz</name>
                  <description>4 KHz.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clkDiv8</name>
                  <description>RTC Input Clock / 8.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>X32KMD</name>
              <description>32KHz Oscillator Mode.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>noiseImmuneMode</name>
                  <description>Always operate in Noise Immune Mode. Oscillator warm-up required.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>quietMode</name>
                  <description>Always operate in Quiet Mode. No oscillator warm-up required.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>quietInStopWithWarmup</name>
                  <description>Operate in Noise Immune Mode normally, switch to Quiet Mode on Stop Mode entry. Will wait for 32K oscillator warm-up before code execution on Stop Mode exit.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>quietInStopNoWarmup</name>
                  <description>Operate in Noise Immune Mode normally, switch to Quiet Mode on Stop Mode entry. Will not wait for 32K oscillator warm-up before code execution on Stop Mode exit.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WE</name>
              <description>Write Enable. This register bit serves as a protection mechanism against unintentional writes to critical RTC bits.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>inactive</name>
                  <description>Not active</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pending</name>
                  <description>Active</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TRIM</name>
          <description>RTC Trim Register.</description>
          <addressOffset>0x14</addressOffset>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>TRIM</name>
              <description>RTC Trim. This register contains the 2's complement value that specifies the trim resolution. Each increment or decrement of the bit adds or subtracts 1ppm at each 4KHz clock value, with a maximum correction of +/- 127ppm.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>VBATTMR</name>
              <description>VBAT Timer Value. When RTC is running off of VBAT, this field is incremented every 32 seconds.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OSCCTRL</name>
          <description>RTC Oscillator Control Register.</description>
          <addressOffset>0x18</addressOffset>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>FLITER_EN</name>
              <description>RTC Oscillator Filter Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IBIAS_SEL</name>
              <description>RTC Oscillator 4X Bias Current Select</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>2X</name>
                  <description>Selects 2X bias current for RTC oscillator</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4X</name>
                  <description>Selects 4X bias current for RTC oscillator</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HYST_EN</name>
              <description>RTC Oscillator Hysteresis Buffer Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IBIAS_EN</name>
              <description>RTC Oscillator Bias Current Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BYPASS</name>
              <description>RTC Crystal Bypass</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>32KOUT</name>
              <description>RTC 32kHz Square Wave Output</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
