cmsis-svd/cmsis-svd/data/Maxim/max32650.svd
        <register>
          <name>MAX_CURR_CFG</name>
          <description>Maximum Current Capabilities.</description>
          <addressOffset>0x048</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>V3_3</name>
              <description>Maximum Current for 3.3V.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>V3_0</name>
              <description>Maximum Current for 3.0V.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>V1_8</name>
              <description>Maximum Current for 1.8V.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FORCE_CMD</name>
          <description>Force Event for Auto CMD Error Status.</description>
          <addressOffset>0x050</addressOffset>
          <size>16</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>NOT_EXCU</name>
              <description>Force Event for Auto CMD12 Not Executed.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TO</name>
              <description>Force Event for Auto CMD Timeout Error.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CRC</name>
              <description>Force Event for Auto CMD CRC Error.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>END_BIT</name>
              <description>Force Event for Auto CMD End Bit Error.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>INDEX</name>
              <description>Force Event for Auto CMD Index Error.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>NOT_ISSUED</name>
              <description>Force Event for Command Not Issued By Auto CMD12 Error.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FORCE_EVENT_INT_STAT</name>
          <description>Force Event for Error Interrupt Status.</description>
          <addressOffset>0x052</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>CMD_TO</name>
              <description>Force Event for Command Timeout Error.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CMD_CRC</name>
              <description>Force Event for Command CRC Error.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CMD_END_BIT</name>
              <description>Force Event for Command End Bit Error.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CMD_INDEX</name>
              <description>Force Event for Command Index Error.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DATA_TO</name>
              <description>Force Event for Data Timeout Error.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DATA_CRC</name>
              <description>Force Event for Data CRC Error.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DATA_END_BIT</name>
              <description>Force Event for Data End Bit Error.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CURR_LIMIT</name>
              <description>Force Event for Current Limit Error.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AUTO_CMD</name>
              <description>Force Event for Auto CMD Error.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ADMA</name>
              <description>Force Event for ADMA Error.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VENDOR</name>
              <description>Force Event for Vendor Specific Error Status.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADMA_ER</name>
          <description>ADMA Error Status.</description>
          <addressOffset>0x054</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>STATE</name>
              <description>ADMA Error State.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>LEN_MISMATCH</name>
              <description>ADMA Length Mismatch Error.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADMA_ADDR_0</name>
          <description>ADMA System Address 0-31.</description>
          <addressOffset>0x058</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ADDR</name>
              <description>ADMA System Address Part 1 (part 2 is ADMA_ADDR_1).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADMA_ADDR_1</name>
          <description>ADMA System Address 32-63.</description>
          <addressOffset>0x05C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ADDR</name>
              <description>ADMA System Address Part 1 (part 2 is ADMA_ADDR_1).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PRESET_0</name>
          <description>Preset Value for Initialization.</description>
          <addressOffset>0x060</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>SDCLK_FREQ</name>
              <description>SDCLK Frequency Select Value.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CLK_GEN</name>
              <description>Clock Generator Select Value.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DRIVER_STRENGTH</name>
              <description>Driver Strength Select Value.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRESET_1</name>
          <description>Preset Value for Default Speed.</description>
          <addressOffset>0x062</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>SDCLK_FREQ</name>
              <description>SDCLK Frequency Select Value.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CLK_GEN</name>
              <description>Clock Generator Select Value.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DRIVER_STRENGTH</name>
              <description>Driver Strength Select Value.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRESET_2</name>
          <description>Preset Value for High Speed.</description>
          <addressOffset>0x064</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>SDCLK_FREQ</name>
              <description>SDCLK Frequency Select Value.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CLK_GEN</name>
              <description>Clock Generator Select Value.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DRIVER_STRENGTH</name>
              <description>Driver Strength Select Value.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRESET_3</name>
          <description>Preset Value for SDR12.</description>
          <addressOffset>0x066</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>SDCLK_FREQ</name>
              <description>SDCLK Frequency Select Value.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CLK_GEN</name>
              <description>Clock Generator Select Value.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DRIVER_STRENGTH</name>
              <description>Driver Strength Select Value.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRESET_4</name>
          <description>Preset Value for SDR25.</description>
          <addressOffset>0x068</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>SDCLK_FREQ</name>
              <description>SDCLK Frequency Select Value.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CLK_GEN</name>
              <description>Clock Generator Select Value.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DRIVER_STRENGTH</name>
              <description>Driver Strength Select Value.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRESET_5</name>
          <description>Preset Value for SDR50.</description>
          <addressOffset>0x06A</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>SDCLK_FREQ</name>
              <description>SDCLK Frequency Select Value.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CLK_GEN</name>
              <description>Clock Generator Select Value.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DRIVER_STRENGTH</name>
              <description>Driver Strength Select Value.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRESET_6</name>
          <description>Preset Value for SDR104.</description>
          <addressOffset>0x06C</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>SDCLK_FREQ</name>
              <description>SDCLK Frequency Select Value.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CLK_GEN</name>
              <description>Clock Generator Select Value.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DRIVER_STRENGTH</name>
              <description>Driver Strength Select Value.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRESET_7</name>
          <description>Preset Value for DDR50.</description>
          <addressOffset>0x06E</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>SDCLK_FREQ</name>
              <description>SDCLK Frequency Select Value.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CLK_GEN</name>
              <description>Clock Generator Select Value.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DRIVER_STRENGTH</name>
              <description>Driver Strength Select Value.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SHARED_BUS</name>
          <description>Shared Bus Control.</description>
          <addressOffset>0x0E0</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>SLOT_INT</name>
          <description>Slot Interrupt Status.</description>
          <addressOffset>0x0FC</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>INT_SIGNALS</name>
              <description>Interrupt Signal For Each Slot.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HOST_CN_VER</name>
          <description>Host Controller Version.</description>
          <addressOffset>0x0FE</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>SPEC_VER</name>
              <description>Specification Version Number.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>VEND_VER</name>
              <description>Vendor Version Number.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
