cmsis-svd/cmsis-svd/data/Maxim/max32650.svd
      </registers>
    </peripheral>
    <!--SDMA Smart DMA-->
    <peripheral>
      <name>SEMA</name>
      <description>The Semaphore peripheral allows multiple cores in a system to cooperate when accessing shred resources. The peripheral contains eight semaphores that can be atomically set and cleared. It is left to the discretion of the software architect to decide how and when the semaphores are used and how they are allocated. Existing hardware does not have to be modified for this type of cooperative sharing, and the use of semaphores is exclusively within the software domain.</description>
      <baseAddress>0x4003E000</baseAddress>
      <addressBlock>
        <offset>0x00</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <dim>8</dim>
          <dimIncrement>4</dimIncrement>
          <name>SEMAPHORES[%s]</name>
          <description>Read to test and set, returns prior value. Write 0 to clear semaphore.</description>
          <addressOffset>0x00</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>sema</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>status</name>
          <description>Semaphore status bits. 0 indicates the semaphore is free, 1 indicates taken.</description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>STATUS</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <!--SEMA The Semaphore peripheral allows multiple cores in a system to cooperate when accessing shred resources. 
		The peripheral contains eight semaphores that can be atomically set and cleared. It is left to the discretion of the software 
		architect to decide how and when the semaphores are used and how they are allocated. Existing hardware does not have to be 
		modified for this type of cooperative sharing, and the use of semaphores is exclusively within the software domain.-->
    <peripheral>
      <name>SIR</name>
      <description>System Initialization Registers.</description>
      <baseAddress>0x40000400</baseAddress>
      <access>read-only</access>
      <addressBlock>
        <offset>0x00</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>SISTAT</name>
          <description>System Initialization Status Register.</description>
          <addressOffset>0x00</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>MAGIC</name>
              <description>Magic Word Validation. This bit is set by the system initialization block following power-up.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>magicNotSet</name>
                  <description>Magic word was not set (OTP has not been initialized properly).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>magicSet</name>
                  <description>Magic word was set (OTP contains valid settings).</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CRCERR</name>
              <description>CRC Error Status. This bit is set by the system initialization block following power-up.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>noError</name>
                  <description>No CRC errors occurred during the read of the OTP memory block.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>error</name>
                  <description>A CRC error occurred while reading the OTP. The address of the failure location in the OTP memory is stored in the ERRADDR register.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ERRADDR</name>
          <description>Read-only field set by the SIB block if a CRC error occurs during the read of the OTP memory. Contains the failing address in OTP memory (when CRCERR equals 1).</description>
          <addressOffset>0x04</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>ERRADDR</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FSTAT</name>
          <description>funcstat register.</description>
          <addressOffset>0x100</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>FPU</name>
              <description>FPU Function.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>no</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>yes</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USB</name>
              <description>USB Device.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>no</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>yes</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC</name>
              <description>10-bit Sigma Delta ADC.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>no</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>yes</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>XIP</name>
              <description>XiP function.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>no</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>yes</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PBM</name>
              <description>PBM function.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>no</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>yes</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HBC</name>
              <description>HBC function.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>no</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>yes</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SDHC</name>
              <description>SDHC function.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>no</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>yes</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SMPHR</name>
              <description>SMPHR function.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>no</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>yes</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SCACHE</name>
              <description>System Cache function.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>no</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>yes</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SFSTAT</name>
          <description>secfuncstat register.</description>
          <addressOffset>0x104</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>TRNG</name>
              <description>TRNG function.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>no</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>yes</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AES</name>
              <description>AES function.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>no</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>yes</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SHA</name>
              <description>SHA function.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>no</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>yes</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MAA</name>
              <description>MAA function.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>no</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>yes</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
