cmsis-svd/cmsis-svd/data/Maxim/max32650.svd
      </registers>
    </peripheral>
    <!--SIR System Initialization Registers.-->
    <peripheral>
      <name>SMON</name>
      <description>The Security Monitor block used to monitor system threat conditions.</description>
      <baseAddress>0x40004000</baseAddress>
      <addressBlock>
        <offset>0x00</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>EXTSCN</name>
          <description>External Sensor Control Register.</description>
          <addressOffset>0x00</addressOffset>
          <resetMask>0x3800FFC0</resetMask>
          <fields>
            <field>
              <name>EXTS_EN0</name>
              <description>External Sensor Enable for input/output pair 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dis</name>
                  <description>Disable.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>en</name>
                  <description>Enable.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTS_EN1</name>
              <description>External Sensor Enable for input/output pair 1.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dis</name>
                  <description>Disable.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>en</name>
                  <description>Enable.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTS_EN2</name>
              <description>External Sensor Enable for input/output pair 2.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dis</name>
                  <description>Disable.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>en</name>
                  <description>Enable.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTS_EN3</name>
              <description>External Sensor Enable for input/output pair 3.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dis</name>
                  <description>Disable.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>en</name>
                  <description>Enable.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTS_EN4</name>
              <description>External Sensor Enable for input/output pair 4.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dis</name>
                  <description>Disable.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>en</name>
                  <description>Enable.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTS_EN5</name>
              <description>External Sensor Enable for input/output pair 5.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dis</name>
                  <description>Disable.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>en</name>
                  <description>Enable.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTCNT</name>
              <description>External Sensor Error Counter. These bits set the number of external sensor accepted mismatches that have to occur within a single bit period before an external sensor alarm is triggered.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>EXTFRQ</name>
              <description>External Sensor Frequency. These bits define the frequency at which the external sensors are clocked to/from the EXTS_IN and EXTS_OUT pair.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>freq2000Hz</name>
                  <description>Div 4 (2000Hz).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>freq1000Hz</name>
                  <description>Div 8 (1000Hz).</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>freq500Hz</name>
                  <description>Div 16 (500Hz).</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>freq250Hz</name>
                  <description>Div 32 (250Hz).</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>freq125Hz</name>
                  <description>Div 64 (125Hz).</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>freq63Hz</name>
                  <description>Div 128 (63Hz).</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>freq31Hz</name>
                  <description>Div 256 (31Hz).</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RFU</name>
                  <description>Reserved. Do not use.</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIVCLK</name>
              <description>Clock Divide. These bits are used to divide the 8KHz input clock. The resulting divided clock is used for all logic within the Security Monitor Block. Note: If the input clock is divided with these bits, the error count threshold table and output frequency will be affected accordingly with the same divide factor.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>div1</name>
                  <description>Divide by 1 (8000 Hz).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>div2</name>
                  <description>Divide by 2 (4000 Hz).</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>div4</name>
                  <description>Divide by 4 (2000 Hz).</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>div8</name>
                  <description>Divide by 8 (1000 Hz).</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>div16</name>
                  <description>Divide by 16 (500 Hz).</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>div32</name>
                  <description>Divide by 32 (250 Hz).</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>div64</name>
                  <description>Divide by 64 (125 Hz).</description>
                  <value>6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BUSY</name>
              <description>Busy. This bit is set to 1 by hardware after EXTSCN register is written to. This bit is automatically cleared to 0 after this register information has been transferred to the security monitor domain.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>idle</name>
                  <description>Idle.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>busy</name>
                  <description>Update in Progress.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOCK</name>
              <description>Lock Register. Once locked, the EXTSCN register can no longer be modified. Only a battery disconnect will clear this bit. VBAT powers this register.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>unlocked</name>
                  <description>Unlocked.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>locked</name>
                  <description>Locked.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INTSCN</name>
          <description>Internal Sensor Control Register.</description>
          <addressOffset>0x04</addressOffset>
          <resetMask>0x7F00FFF7</resetMask>
          <fields>
            <field>
              <name>SHIELD_EN</name>
              <description>Die Shield Enable.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dis</name>
                  <description>Disable.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>en</name>
                  <description>Enable.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TEMP_EN</name>
              <description>Temperature Sensor Enable.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dis</name>
                  <description>Disable.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>en</name>
                  <description>Enable.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VBAT_EN</name>
              <description>Battery Monitor Enable.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dis</name>
                  <description>Disable.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>en</name>
                  <description>Enable.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOTEMP_SEL</name>
              <description>Low Temperature Detection Select.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>neg50C</name>
                  <description>-50 degrees C.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>neg30C</name>
                  <description>-30 degrees C.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VCORELOEN</name>
              <description>VCORE Undervoltage Detect Enable.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dis</name>
                  <description>Disable.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>en</name>
                  <description>Enable.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VCOREHIEN</name>
              <description>VCORE Overvoltage Detect Enable.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dis</name>
                  <description>Disable.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>en</name>
                  <description>Enable.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VDDLOEN</name>
              <description>VDD Undervoltage Detect Enable.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dis</name>
                  <description>Disable.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>en</name>
                  <description>Enable.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VDDHIEN</name>
              <description>VDD Overvoltage Detect Enable.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dis</name>
                  <description>Disable.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>en</name>
                  <description>Enable.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VGLEN</name>
              <description>Voltage Glitch Detection Enable.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dis</name>
                  <description>Disable.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>en</name>
                  <description>Enable.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOCK</name>
              <description>Lock Register. Once locked, the INTSCN register can no longer be modified. Only a battery disconnect will clear this bit. VBAT powers this register.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>unlocked</name>
                  <description>Unlocked.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>locked</name>
                  <description>Locked.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
