cmsis-svd/cmsis-svd/data/Maxim/max32650.svd
        <register>
          <name>SECDIAG</name>
          <description>Security Diagnostic Register.</description>
          <addressOffset>0x0C</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000001</resetValue>
          <resetMask>0xFFC0FE02</resetMask>
          <fields>
            <field>
              <name>BORF</name>
              <description>Battery-On-Reset Flag. This bit is set once the back up battery is conneted.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>noEvent</name>
                  <description>The event has not occurred.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>occurred</name>
                  <description>The event has occurred.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SHIELDF</name>
              <description>Die Shield Flag.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>noEvent</name>
                  <description>The event has not occurred.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>occurred</name>
                  <description>The event has occurred.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOTEMP</name>
              <description>Low Temperature Detect.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>noEvent</name>
                  <description>The event has not occurred.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>occurred</name>
                  <description>The event has occurred.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HITEMP</name>
              <description>High Temperature Detect.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>noEvent</name>
                  <description>The event has not occurred.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>occurred</name>
                  <description>The event has occurred.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BATLO</name>
              <description>Battery Undervoltage Detect.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>noEvent</name>
                  <description>The event has not occurred.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>occurred</name>
                  <description>The event has occurred.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BATHI</name>
              <description>Battery Overvoltage Detect.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>noEvent</name>
                  <description>The event has not occurred.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>occurred</name>
                  <description>The event has occurred.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DYNF</name>
              <description>Dynamic Sensor Flag. This bit is set to 1 when any of the EXTSTAT bits are set.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>noEvent</name>
                  <description>The event has not occurred.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>occurred</name>
                  <description>The event has occurred.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AESKT</name>
              <description>AES Key Transfer. This bit is set to 1 when AES Key has been transferred from the TRNG to the battery backed AES key register. This bit can only be reset by a BOR.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>incomplete</name>
                  <description>Key has not been transferred.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>complete</name>
                  <description>Key has been transferred.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTSTAT0</name>
              <description>External Sensor 0 Detect.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>noEvent</name>
                  <description>The event has not occurred.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>occurred</name>
                  <description>The event has occurred.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTSTAT1</name>
              <description>External Sensor 1 Detect.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>noEvent</name>
                  <description>The event has not occurred.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>occurred</name>
                  <description>The event has occurred.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTSTAT2</name>
              <description>External Sensor 2 Detect.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>noEvent</name>
                  <description>The event has not occurred.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>occurred</name>
                  <description>The event has occurred.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTSTAT3</name>
              <description>External Sensor 3 Detect.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>noEvent</name>
                  <description>The event has not occurred.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>occurred</name>
                  <description>The event has occurred.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTSTAT4</name>
              <description>External Sensor 4 Detect.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>noEvent</name>
                  <description>The event has not occurred.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>occurred</name>
                  <description>The event has occurred.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTSTAT5</name>
              <description>External Sensor 5 Detect.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>noEvent</name>
                  <description>The event has not occurred.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>occurred</name>
                  <description>The event has occurred.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DLRTC</name>
          <description>DRS Log RTC Value. This register contains the 32 bit value in the RTC second register when the last DRS event occurred.</description>
          <addressOffset>0x10</addressOffset>
          <access>read-only</access>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>DLRTC</name>
              <description>DRS Log RTC Value. This register contains the 32 bit value in the RTC second register when the last DRS event occured.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SECST</name>
          <description>Security Monitor Status Register.</description>
          <addressOffset>0x34</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>EXTSRS</name>
              <description>External Sensor Control Register Status.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>allowed</name>
                  <description>Access authorized.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>notAllowed</name>
                  <description>Access not authorized.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INTSRS</name>
              <description>Internal Sensor Control Register Status.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>allowed</name>
                  <description>Access authorized.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>notAllowed</name>
                  <description>Access not authorized.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SECALRS</name>
              <description>Security Alarm Register Status.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>allowed</name>
                  <description>Access authorized.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>notAllowed</name>
                  <description>Access not authorized.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
