cmsis-svd/cmsis-svd/data/Maxim/max32650.svd
        <register>
          <name>DMA</name>
          <description>SPI DMA Register.</description>
          <addressOffset>0x18</addressOffset>
          <resetValue>0x00070007</resetValue>
          <fields>
            <field>
              <name>TX_FIFO_LEVEL</name>
              <description>Transmit FIFO Level. Set the number of free entries in the TxFIFO when a TxDMA request occurs.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <name>fifo_level_enum</name>
                <enumeratedValue>
                  <name>entry1</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>entries2</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>entries3</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>entries4</name>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>entries5</name>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>entries6</name>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>entries7</name>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>entries8</name>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TX_FIFO_CLEAR</name>
              <description>Transmit FIFO Clear.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <name>start_op_enum</name>
                <enumeratedValue>
                  <name>complete</name>
                  <description>No operation/complete.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>start</name>
                  <description>Start operation.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TX_FIFO_CNT</name>
              <description>Transmit FIFO Count.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TX_DMA_EN</name>
              <description>Transmit DMA Enable.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>dis_en_enum</name>
                <enumeratedValue>
                  <name>disable</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>enable</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RX_FIFO_LEVEL</name>
              <description>Receive FIFO Level. Sets the RX FIFO DMA request threshold. This configures the number of filled RxFIFO entries before activating an RxDMA request.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <name>fifo_level_enum</name>
                <enumeratedValue>
                  <name>entry1</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>entries2</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>entries3</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>entries4</name>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>entries5</name>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>entries6</name>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>entries7</name>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>entries8</name>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RX_FIFO_CLEAR</name>
              <description>Receive FIFO Clear.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>start_op_enum</name>
                <enumeratedValue>
                  <name>complete</name>
                  <description>No operation/complete.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>start</name>
                  <description>Start operation.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RX_FIFO_CNT</name>
              <description>Receive FIFO Count.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RX_DMA_EN</name>
              <description>Receive DMA Enable.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>dis_en_enum</name>
                <enumeratedValue>
                  <name>disable</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>enable</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>I2S_CTRL</name>
          <description>I2S Control Register.</description>
          <addressOffset>0x1C</addressOffset>
          <fields>
            <field>
              <name>I2S_EN</name>
              <description>I2S Mode Enable.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>dis_en_enum</name>
                <enumeratedValue>
                  <name>disable</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>enable</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>I2S_MUTE</name>
              <description>I2S Mute transmit.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>normal</name>
                  <description>Normal Transmit.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>replaced</name>
                  <description>Transmit data is replaced with 0.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>I2S_PAUSE</name>
              <description>I2S Pause transmit/receive.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>normal</name>
                  <description>Normal Transmit.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>halt</name>
                  <description>Halt transmit and receive FIFO and DMA access, transmit 0's.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>I2S_MONO</name>
              <description>I2S Monophonic Audio Mode.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>stereophonic</name>
                  <description>Stereophonic audio.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>monophonic</name>
                  <description>Monophonic audio format.Each transmit data word is replicated on both left/right channels. Receive data is taken from left channel, right channel receive data is ignored.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>I2S_LJ</name>
              <description>I2S Left Justify.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>normal</name>
                  <description>Normal I2S audio protocol.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>replaced</name>
                  <description>Audio data is synchronized with SSEL.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
