cmsis-svd/cmsis-svd/data/Maxim/max32650.svd
      </registers>
    </peripheral>
    <!--SPIMSS Serial Peripheral Interface.-->
    <peripheral>
      <name>CLCD</name>
      <description>Color LCD Controller</description>
      <baseAddress>0x40031000</baseAddress>
      <addressBlock>
        <offset>0x00</offset>
        <size>0xFFF</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CLK</name>
          <description>LCD Clock Register</description>
          <addressOffset>0x000</addressOffset>
          <fields>
            <field>
              <name>CLKDIV</name>
              <description>Clock divsor</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>ACB</name>
              <description>ACB</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>DPOL</name>
              <description>D Polarity</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACTIVEHI</name>
                  <description>Active Hi</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVELO</name>
                  <description>Active Low</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VPOL</name>
              <description>V Polarity</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HPOL</name>
              <description>H Polarity</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACTIVEHI</name>
                  <description>Active Hi</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVELO</name>
                  <description>Active Low</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDGE</name>
              <description>Edge Selection</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POSEDGE</name>
                  <description>Positve edge</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NEGEDGE</name>
                  <description>Negative Edge</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PASCLK</name>
              <description>Clock Active on Data</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALWAYSACTIVE</name>
                  <description>Always Active</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVEONDATA</name>
                  <description>ACTIVE ON DATA</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>VTIM_0</name>
          <description>LCD Vertical Timing 0 Register</description>
          <addressOffset>0x004</addressOffset>
          <fields>
            <field>
              <name>VLINES</name>
              <description>V Lines</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>VBACKPORCH</name>
              <description>V BACK PORCH</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>VTIM_1</name>
          <description>LCD Vertical Timing 1 Register</description>
          <addressOffset>0x008</addressOffset>
          <fields>
            <field>
              <name>VSYNCWIDTH</name>
              <description>V Sync Width</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>VFRONTPORCH</name>
              <description>V Front PORCH</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HTIM</name>
          <description>LCD Horizontal Timing Register.</description>
          <addressOffset>0x00C</addressOffset>
          <fields>
            <field>
              <name>HSYNCWIDTH</name>
              <description>Horizontal Sync Width in CLCD Clocks from 1 to 256 HSync Width = HSYNCWIDTH+1 Clocks</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>HFRONTPORCH</name>
              <description>Horizontal Front Porch size in lines from 1 to 256</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>HSIZE</name>
              <description>Horizontal Front Porch Size in Pixels = (HSIZE + 1)*16</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>HBACKPORCH</name>
              <description>Horizontal Back Porch size in CLCD Clocks from 1 to 256 -> HBP=(HBACKPORCH+1)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRL</name>
          <description>LCD Control Register</description>
          <addressOffset>0x010</addressOffset>
          <fields>
            <field>
              <name>LCDEN</name>
              <description>LCD Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VISEL</name>
              <description>VI Select</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ONVERTSYNC</name>
                  <description>On Vertical Sync</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONVERTBACKPORCH</name>
                  <description>On Vertical Back Porch</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONACTIVEVIDEO</name>
                  <description>On Active Video</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONVERTFRONTPORCH</name>
                  <description>On Vertical Front Porch</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DISPTYPE</name>
              <description>Display Type</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STNCOLOR8BIT</name>
                  <description>STN Color 8 bit</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLCD</name>
                  <description>CLCD</description>
                  <value>8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BPP</name>
              <description>BPP</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BPP1</name>
                  <description>BPP 1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BPP2</name>
                  <description>BPP 2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BPP4</name>
                  <description>BPP 4</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BPP8</name>
                  <description>BPP 8</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BPP16</name>
                  <description>BPP 16</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BPP24</name>
                  <description>BPP 24</description>
                  <value>5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MODE565</name>
              <description>MODE565</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MODE555</name>
                  <description>MODE 555</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE565</name>
                  <description>MODE 565</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EMODE</name>
              <description>EMODE</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LLBP</name>
                  <description>LLBP</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BBBP</name>
                  <description>BBBP</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LBBP</name>
                  <description>LBBP</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RFU</name>
                  <description>RFU</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>C24</name>
              <description>C24</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BURST</name>
              <description>BURST</description>
              <bitOffset>19</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WORDS4</name>
                  <description>WORDS4</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WORDS8</name>
                  <description>WORDS8</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPOL</name>
              <description>LPOL</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACTIVEHI</name>
                  <description>ACTIVE HIGH</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVELO</name>
                  <description>ACTIVE LOW</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PEN</name>
              <description>PEN</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FR</name>
          <description>FR</description>
          <addressOffset>0x18</addressOffset>
        </register>
        <register>
          <name>INT_EN</name>
          <description>LCD Interrupt Enable Register.</description>
          <addressOffset>0x020</addressOffset>
          <fields>
            <field>
              <name>UFLO</name>
              <description>Under FLow Interupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ADRRDY</name>
              <description>Address Ready Interupt Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VCI</name>
              <description>VCI Interupt Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BERR</name>
              <description>BERR Interupt Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>STAT</name>
          <description>LCD Status Register.</description>
          <addressOffset>0x024</addressOffset>
          <modifiedWriteValues>oneToClear</modifiedWriteValues>
          <fields>
            <field>
              <name>UFLO</name>
              <description>Under FLow Interupt Status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Inactive</name>
                  <description>No interrupt pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pending</name>
                  <description>Interrupt pending</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Clears the interrupt flag</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADRRDY</name>
              <description>Address Ready Interupt Status</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Inactive</name>
                  <description>No interrupt pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pending</name>
                  <description>Interrupt pending</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Clears the interrupt flag</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VCI</name>
              <description>VCI Interupt Status</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Inactive</name>
                  <description>No interrupt pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pending</name>
                  <description>Interrupt pending</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Clears the interrupt flag</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BERR</name>
              <description>BERR Interupt Status</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Inactive</name>
                  <description>No interrupt pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pending</name>
                  <description>Interrupt pending</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Clears the interrupt flag</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LCDIDLE</name>
              <description>LCD IDLE Staus</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BUSY</name>
                  <description>BUSY</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READY</name>
                  <description>READY</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>HV_PHASE</name>
          <description>HV Phase</description>
          <addressOffset>0x30</addressOffset>
        </register>
        <register>
          <dim>256</dim>
          <dimIncrement>4</dimIncrement>
          <name>PALETTE[%s]</name>
          <description>Palette</description>
          <addressOffset>0x400</addressOffset>
        </register>
