cmsis-svd/cmsis-svd/data/Maxim/max32650.svd
      </registers>
    </peripheral>
    <!--TMR0 32-bit reloadable timer that can be used for timing and event counting.-->
    <peripheral derivedFrom="TMR0">
      <name>TMR1</name>
      <description>32-bit reloadable timer that can be used for timing and event counting. 1</description>
      <baseAddress>0x40011000</baseAddress>
      <interrupt>
        <name>TMR1</name>
        <description>TMR1 IRQ</description>
        <value>6</value>
      </interrupt>
    </peripheral>
    <!--TMR1 32-bit reloadable timer that can be used for timing and event counting. 1-->
    <peripheral derivedFrom="TMR0">
      <name>TMR2</name>
      <description>32-bit reloadable timer that can be used for timing and event counting. 2</description>
      <baseAddress>0x40012000</baseAddress>
      <interrupt>
        <name>TMR2</name>
        <description>TMR2 IRQ</description>
        <value>7</value>
      </interrupt>
    </peripheral>
    <!--TMR2 32-bit reloadable timer that can be used for timing and event counting. 2-->
    <peripheral derivedFrom="TMR0">
      <name>TMR3</name>
      <description>32-bit reloadable timer that can be used for timing and event counting. 3</description>
      <baseAddress>0x40013000</baseAddress>
      <interrupt>
        <name>TMR3</name>
        <description>TMR3 IRQ</description>
        <value>8</value>
      </interrupt>
    </peripheral>
    <!--TMR3 32-bit reloadable timer that can be used for timing and event counting. 3-->
    <peripheral derivedFrom="TMR0">
      <name>TMR4</name>
      <description>32-bit reloadable timer that can be used for timing and event counting. 4</description>
      <baseAddress>0x40014000</baseAddress>
      <interrupt>
        <name>TMR4</name>
        <description>TMR4 IRQ</description>
        <value>9</value>
      </interrupt>
    </peripheral>
    <!--TMR4 32-bit reloadable timer that can be used for timing and event counting. 4-->
    <peripheral derivedFrom="TMR0">
      <name>TMR5</name>
      <description>32-bit reloadable timer that can be used for timing and event counting. 5</description>
      <baseAddress>0x40015000</baseAddress>
      <interrupt>
        <name>TMR5</name>
        <description>TMR5 IRQ</description>
        <value>10</value>
      </interrupt>
    </peripheral>
    <!--TMR5 32-bit reloadable timer that can be used for timing and event counting. 5-->
    <peripheral>
      <name>TRNG</name>
      <description>Random Number Generator.</description>
      <baseAddress>0x400B5000</baseAddress>
      <addressBlock>
        <offset>0x00</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>TRNG</name>
        <description>TRNG interrupt.</description>
        <value>4</value>
      </interrupt>
      <registers>
        <register>
          <name>CN</name>
          <description>TRNG Control Register.</description>
          <addressOffset>0x00</addressOffset>
          <resetValue>0x00000003</resetValue>
          <fields>
            <field>
              <name>RNG_IE</name>
              <description>Random Number Interrupt Enable. This bit enables an interrupt to be generated when a new, 128 bit, random number is ready to be read.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dis</name>
                  <description>Disable.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>en</name>
                  <description>Enable.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RNG_ISC</name>
              <description>Random Number Interrupt Status Clear. Setting this bit to 1 clears the RNG_I4S bit and acknowledges the interrupt, if enabled. This bit is a write only bit and always reads as zero.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>no_effect</name>
                  <description>No Effect.</description>
                  <isDefault>true</isDefault>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clear</name>
                  <description>Clear the Status bit.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RNG_I4S</name>
              <description>Random Number 4 Word Status. This bit is set when a new 128 bit random number is ready to be read (using 4 consecutive reads of the TRNG Data Register). When set, an interrupt will be generated if the RNG_IE bit is also set. This bit is cleared by setting the RNG_ISC bit.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>busy</name>
                  <description>Result not ready.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ready</name>
                  <description>Operation complete and result ready.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RNG_IS</name>
              <description>Random Number Word Status. This bit is set when at least one 32 bit random number is ready to be read. This bit is cleared by hardware if all the random words have been read. It is needed to poll this bit before reading the TRNG Data Register.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>busy</name>
                  <description>Result not ready.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ready</name>
                  <description>Operation complete and result ready.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AESKG</name>
              <description>AES Key Generate. When enabled, the key for securing NVSRAM is generated and transferred to the secure key register automatically without user visibility or intervention. This bit is cleared by hardware once the key has been transferred to the secure key register.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>complete</name>
                  <description>No operation/complete.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>start</name>
                  <description>Start operation.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DATA</name>
          <description>Data. The content of this register is valid only when RNG_IS = 1. When TRNG is disabled, read returns 0x0000 0000.</description>
          <addressOffset>0x04</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>DATA</name>
              <description>Data. The content of this register is valid only when RNG_IS =1. When TNRG is disabled, read returns 0x0000 0000.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
