cmsis-svd/cmsis-svd/data/Maxim/max32650.svd
        <register>
          <name>OUTMAXP</name>
          <description>Maximum packet size for OUTx endpoint (x == INDEX).</description>
          <addressOffset>0x14</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>NUMPACKMINUS1</name>
              <description>Number of Split Packets -1. Defines the maximum number of packets - 1 that a usb payload is combined into. The value must be exact multiple of maxpacketsize.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>MAXPACKETSIZE</name>
              <description>Maximum Packet in a Single Transaction. This is the maximum packet size, in bytes, that is transmitted for each microframe. The maximum value is 1024, subject to the limitations for the endpoint type set in USB2.0 spesification, chapter 9.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OUTCSRL</name>
          <description>Control status lower register for OUTx endpoint (x == INDEX).</description>
          <addressOffset>0x16</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>CLRDATATOG</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SENTSTALL</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SENDSTALL</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLUSHFIFO</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATAERROR</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OVERRUN</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FIFOFULL</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUTPKTRDY</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUTCSRU</name>
          <description>Control status upper register for OUTx endpoint (x == INDEX).</description>
          <addressOffset>0x17</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>AUTOCLEAR</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ISO</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMAREQEN</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DISNYET</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMAREQMODE</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DPKTBUFDIS</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INCOMPRX</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COUNT0</name>
          <description>Number of received bytes in EP 0 FIFO (INDEX == 0).</description>
          <addressOffset>0x18</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>COUNT0</name>
              <description>Read Number of Data Bytes in the Endpoint 0 FIFO. Returns the number of data bytes in the endpoint 0 FIFO. This value changes as contents of the FIFO change. The value is only valued when USBHS_OUTSCRL_outpktrdy = 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUTCOUNT</name>
          <description>Number of received bytes in OUT EPx FIFO (x == INDEX).</description>
          <addressOffset>0x18</addressOffset>
          <alternateRegister>COUNT0</alternateRegister>
          <size>16</size>
          <fields>
            <field>
              <name>OUTCOUNT</name>
              <description>Read Number of Data Bytes in OUT FIFO. Returns the number of data bytes in the packet that are read next in the OUT FIFO.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FIFO0</name>
          <description>Read for OUT data FIFO, write for IN data FIFO.</description>
          <addressOffset>0x20</addressOffset>
          <fields>
            <field>
              <name>USBHS_FIFO0</name>
              <description>USBHS Endpoint FIFO Read/Write Register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FIFO1</name>
          <description>Read for OUT data FIFO, write for IN data FIFO.</description>
          <addressOffset>0x24</addressOffset>
          <fields>
            <field>
              <name>USBHS_FIFO1</name>
              <description>USBHS Endpoint FIFO Read/Write Register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FIFO2</name>
          <description>Read for OUT data FIFO, write for IN data FIFO.</description>
          <addressOffset>0x28</addressOffset>
          <fields>
            <field>
              <name>USBHS_FIFO2</name>
              <description>USBHS Endpoint FIFO Read/Write Register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FIFO3</name>
          <description>Read for OUT data FIFO, write for IN data FIFO.</description>
          <addressOffset>0x2c</addressOffset>
          <fields>
            <field>
              <name>USBHS_FIFO3</name>
              <description>USBHS Endpoint FIFO Read/Write Register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FIFO4</name>
          <description>Read for OUT data FIFO, write for IN data FIFO.</description>
          <addressOffset>0x30</addressOffset>
          <fields>
            <field>
              <name>USBHS_FIFO4</name>
              <description>USBHS Endpoint FIFO Read/Write Register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FIFO5</name>
          <description>Read for OUT data FIFO, write for IN data FIFO.</description>
          <addressOffset>0x34</addressOffset>
          <fields>
            <field>
              <name>USBHS_FIFO5</name>
              <description>USBHS Endpoint FIFO Read/Write Register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FIFO6</name>
          <description>Read for OUT data FIFO, write for IN data FIFO.</description>
          <addressOffset>0x38</addressOffset>
          <fields>
            <field>
              <name>USBHS_FIFO6</name>
              <description>USBHS Endpoint FIFO Read/Write Register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FIFO7</name>
          <description>Read for OUT data FIFO, write for IN data FIFO.</description>
          <addressOffset>0x3c</addressOffset>
          <fields>
            <field>
              <name>USBHS_FIFO7</name>
              <description>USBHS Endpoint FIFO Read/Write Register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FIFO8</name>
          <description>Read for OUT data FIFO, write for IN data FIFO.</description>
          <addressOffset>0x40</addressOffset>
          <fields>
            <field>
              <name>USBHS_FIFO8</name>
              <description>USBHS Endpoint FIFO Read/Write Register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FIFO9</name>
          <description>Read for OUT data FIFO, write for IN data FIFO.</description>
          <addressOffset>0x44</addressOffset>
          <fields>
            <field>
              <name>USBHS_FIFO9</name>
              <description>USBHS Endpoint FIFO Read/Write Register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FIFO10</name>
          <description>Read for OUT data FIFO, write for IN data FIFO.</description>
          <addressOffset>0x48</addressOffset>
          <fields>
            <field>
              <name>USBHS_FIFO10</name>
              <description>USBHS Endpoint FIFO Read/Write Register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FIFO11</name>
          <description>Read for OUT data FIFO, write for IN data FIFO.</description>
          <addressOffset>0x4c</addressOffset>
          <fields>
            <field>
              <name>USBHS_FIFO11</name>
              <description>USBHS Endpoint FIFO Read/Write Register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FIFO12</name>
          <description>Read for OUT data FIFO, write for IN data FIFO.</description>
          <addressOffset>0x50</addressOffset>
          <fields>
            <field>
              <name>USBHS_FIFO12</name>
              <description>USBHS Endpoint FIFO Read/Write Register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FIFO13</name>
          <description>Read for OUT data FIFO, write for IN data FIFO.</description>
          <addressOffset>0x54</addressOffset>
          <fields>
            <field>
              <name>USBHS_FIFO13</name>
              <description>USBHS Endpoint FIFO Read/Write Register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FIFO14</name>
          <description>Read for OUT data FIFO, write for IN data FIFO.</description>
          <addressOffset>0x58</addressOffset>
          <fields>
            <field>
              <name>USBHS_FIFO14</name>
              <description>USBHS Endpoint FIFO Read/Write Register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FIFO15</name>
          <description>Read for OUT data FIFO, write for IN data FIFO.</description>
          <addressOffset>0x5c</addressOffset>
          <fields>
            <field>
              <name>USBHS_FIFO15</name>
              <description>USBHS Endpoint FIFO Read/Write Register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HWVERS</name>
          <description>HWVERS</description>
          <addressOffset>0x6c</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USBHS_HWVERS</name>
              <description>USBHS Register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EPINFO</name>
          <description>Endpoint hardware information.</description>
          <addressOffset>0x78</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>OUTENDPOINTS</name>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>INTENDPOINTS</name>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RAMINFO</name>
          <description>RAM width and DMA hardware information.</description>
          <addressOffset>0x79</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>DMACHANS</name>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RAMBITS</name>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SOFTRESET</name>
          <description>Software reset register.</description>
          <addressOffset>0x7A</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>RSTXS</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSTS</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EARLYDMA</name>
          <description>DMA timing control register.</description>
          <addressOffset>0x7B</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>EDMAIN</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EDMAOUT</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTUCH</name>
          <description>Chirp timeout timer setting.</description>
          <addressOffset>0x80</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>C_T_UCH</name>
              <description>HS Chirp Timeout Clock Cycles. This configures the chirp timeout used by this device to negotiate a HS connection with a FS Host.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CTHSRTN</name>
          <description>Sets delay between HS resume to UTM normal operating mode.</description>
          <addressOffset>0x82</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>C_T_HSTRN</name>
              <description>High Speed Resume Delay Clock Cycles. This configures the delay from when the RESUME state on the bus ends, the when the USBHS resumes normal operation.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>M31_PHY_PONRST</name>
          <description>M31_PHY_PONRST</description>
          <addressOffset>0x410</addressOffset>
        </register>
        <register>
          <name>M31_PHY_NONCRY_RSTB</name>
          <description>M31_PHY_NONCRY_RSTB</description>
          <addressOffset>0x414</addressOffset>
        </register>
        <register>
          <name>M31_PHY_NONCRY_EN</name>
          <description>M31_PHY_NONCRY_EN</description>
          <addressOffset>0x418</addressOffset>
        </register>
        <register>
          <name>M31_PHY_PLL_EN</name>
          <description>M31_PHY_PLL_EN</description>
          <addressOffset>0x430</addressOffset>
        </register>
        <register>
          <name>M31_PHY_OSCOUTEN</name>
          <description>M31_PHY_OSCOUTEN</description>
          <addressOffset>0x43C</addressOffset>
        </register>
        <register>
          <name>M31_PHY_CORECLKIN</name>
          <description>M31_PHY_CORECLKIN</description>
          <addressOffset>0x448</addressOffset>
        </register>
        <register>
          <name>M31_PHY_XTLSEL</name>
          <description>M31_PHY_XTLSEL</description>
          <addressOffset>0x44C</addressOffset>
        </register>
        <register>
          <name>M31_PHY_OUTCLKSEL</name>
          <description>M31_PHY_OUTCLKSEL</description>
          <addressOffset>0x45C</addressOffset>
        </register>
        <register>
          <name>MXM_INT</name>
          <description>USB Added Maxim Interrupt Flag Register.</description>
          <addressOffset>0x498</addressOffset>
          <fields>
            <field>
              <name>VBUS</name>
              <description>VBUS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NOVBUS</name>
              <description>NOVBUS</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MXM_INT_EN</name>
          <description>USB Added Maxim Interrupt Enable Register.</description>
          <addressOffset>0x49C</addressOffset>
          <fields>
            <field>
              <name>VBUS</name>
              <description>VBUS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NOVBUS</name>
              <description>NOVBUS</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MXM_SUSPEND</name>
          <description>USB Added Maxim Suspend Register.</description>
          <addressOffset>0x4A0</addressOffset>
          <fields>
            <field>
              <name>SEL</name>
              <description>Suspend register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MXM_REG_A4</name>
          <description>USB Added Maxim Power Status Register</description>
          <addressOffset>0x4A4</addressOffset>
          <fields>
            <field>
              <name>VRST_VDDB_N_A</name>
              <description>VRST_VDDB_N_A</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMA_INT</name>
              <description>DMA_INT</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
